[{"markernum":"558","title":"Buell School","indexname":"Buell School","address":"218 E. Juarez","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581701","utm_north":"2897177","code":"educational buildings; women, women's history topics; educational topics; Classical Revival (architectural style); design and construction","year":"1990","rthl":"1","loc_desc":"218 E. Juarez, Pharr","size":"16\"\" x 12\"\"","markertext":"Constructed in 1927-28 to serve Mexican-American children in the Pharr-San Juan School District, this school replaced an earlier facility at this site.  The new school was named in honor of educator Helen W. Buell (1861-1949), principal of the Pharr Mexican Ward School from 1924 to 1932.  Designed by noted San Antonio architect Harvey Smith, the building's entry features modest classical revival detailing in its roof line scrollwork and bas-relief medallion over the entry.  Recorded Texas Historic Landmark - 1990","atlas_number":"5215000558","latitude":26.191754041853887,"longitude":-98.18230902478035},
{"markernum":"1955","title":"Former Station Site of Spiderweb Railroad","indexname":"Spiderweb Railroad, Former Station Site of","address":"","city":"Progresso","county":"Hidalgo","utm_zone":"14","utm_east":"603870","utm_north":"2885410","code":"railroads; land surveys, land companies, promotional towns","year":"1982","rthl":"0","loc_desc":"(on Train Depot) FM 1015, Progresso (.3 mi north of US 281)","size":"18\"\" x 28\"\"","markertext":"The agricultural boom that marked the early development of this area was due in large part to the San Benito & Rio Grande Valley Railroad.  Begun in 1912 by Missouri native Sam A. Robertson (1867-1938), it was called the Spiderweb Railroad because of its intricate network of lines and spurs.  The railroad built a station here in 1926 as the hub of a community and citrus production center planned by the Progreso Development Co.  Through early valley shipping centers such as Progreso, local produce was first transported to markets nationwide.  (1982)","atlas_number":"5215001955","latitude":26.084087349734705,"longitude":-97.96140070142785},
{"markernum":"3271","title":"McAllen Lodge No. 1110, A.F. and A.M.","indexname":"McAllen Lodge No. 1110,  A. F. and A. M.","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576849","utm_north":"2898599","code":"fraternal organizations; fairs and festivals","year":"1994","rthl":"0","loc_desc":"118 North 11th Street, McAllen","size":"18\"\" x 28\"\"","markertext":"This lodge, organized by Master Mason R. M. Bounds and about 30 other Masons, was chartered on December 8, 1915.  Meetings were held in the Joseph and Osborne buildings, two early downtown commercial structures, prior to the lodge erecting a temple at this site in 1927.  Noted early teachers Isadore Moritz and Hugh R. Lockhart instructed a membership consisting of people from various masonic jurisdictions.  The lodge is notable for having two members who became Grand Masters.  Lodge No. 1110 continues to be active in local civic affairs.  (1995)","atlas_number":"5215003271","latitude":26.20486076026827,"longitude":-98.23078150519213},
{"markernum":"3571","title":"Nellie Leo Schunior School","indexname":"Schunior, Nellie Leo, School","address":"","city":"La Joya","county":"Hidalgo","utm_zone":"14","utm_east":"551711","utm_north":"2903143","code":"women, women's history topics; educational topics","year":"1991","rthl":"0","loc_desc":"U.S. Business 83 west, La Joya","size":"18\"\" x 28\"\"","markertext":"This school's roots lie in the former town of Havana (2 miles south), where between 1890 and 1944 area children, most of whom lived on nearby ranches, attended classes in a one-room school house.  Nellie Leo Schunior (1878-1920), who later became the first superintendent of Chapin (now Edinburg) schools, taught in Havana from 1913 until 1916.  Several years after her death, persistent flooding of the Rio Grande caused Havana residents to relocate their town to this area.  They renamed the town La Joya, and built a new school in 1926 which they named in Schunior's honor.  (1992)","atlas_number":"5215003571","latitude":26.247015063803495,"longitude":-98.48220794799029},
{"markernum":"3779","title":"Old Pharr City Hall","indexname":"Pharr City Hall, Old","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581473","utm_north":"2897472","code":"cities and towns","year":"1984","rthl":"0","loc_desc":"Cage Blvd. (US 281) at Park, Pharr","size":"18\"\" x 28\"\"","markertext":"This structure was completed in 1911 by the Pharr Townsite Company, operated by John C. Kelly (1862-1937), a co-founder of Pharr.  It housed the first bank, the post office, a confectionary, a drugstore, and the first irrigation and canal company.  The building became the first City Hall in 1916, when Pharr was incorporated.  Due to a shortage of policemen during the depression, an electric light was placed on top of the building to alert officers to trouble.  When the city government moved in 1951, the Old Pharr City Hall housed businesses and offices and was used for civic meetings.  (1984)","atlas_number":"5215003779","latitude":26.19443045825994,"longitude":-98.18457219324358},
{"markernum":"4429","title":"Sacred Heart Catholic Church","indexname":"Sacred Heart Catholic Church","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576315","utm_north":"2898170","code":"churches; Roman Catholic denomination","year":"1986","rthl":"0","loc_desc":"306 South 15th Street, McAllen","size":"18\"\" x 28\"\"","markertext":"Priests from La Lomita Chapel in nearby Mission ministered to Catholics at McAllen from 1908 until 1911, when a mission was begun here and a wood frame chapel was built.  The congregation remained under the guidance of the Rev. J. M. F. Guenneugues, O.M.I., of Mission until 1915, when the Rev. Francis A. Dupassieux, O.M.I., came to the McAllen Chapel.  By 1917 a school and rectory were added and Sacred Heart became an independent parish.  Sacred Heart parish has served as \"\"Mother Church\"\" to many missions in central Hidalgo County.  Texas Sesquicentennial 1836-1986.","atlas_number":"5215004429","latitude":26.201015890258834,"longitude":-98.23615146343187},
{"markernum":"4544","title":"San Juan Plantation","indexname":"San Juan Plantation","address":"","city":"San Juan","county":"Hidalgo","utm_zone":"14","utm_east":"583170","utm_north":"2885073","code":"houses, residential buildings; plantations","year":"1964","rthl":"1","loc_desc":"from San Juan, take FM 2557 south to Highway 281, about 5.5 miles and continue south on County Road for .5 miles to Loval Road, then go west about .25 miles","size":"16\"\" x 12\"\"","markertext":"Built 1904 by John Closner, 1891-1912 sheriff of Hidalgo County, who helped bring in and finance railroads and establish respect for law.  Only reminder today of the 45,000 acre plantation complex that had sugar mill, post office, general store, pumping station, and produced sugar cane, cotton, potatoes, alfalfa and onions.  Built the same year Closner's sugar won St. Louis World's Fair medal.  (1964)","atlas_number":"5215004544","latitude":26.082385952303184,"longitude":-98.16838256186},
{"markernum":"14165","title":"Guadalupe Cemetery","indexname":"Guadalupe Cemetery","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581112","utm_north":"2898094","code":"graveyards; Mexican immigrants/immigration; Anglo American","year":"2008","rthl":"0","loc_desc":"intersection of Bella & Canna Sts.","size":"18\"\" x 28\"\"","markertext":"<center><b>Guadalupe Cemetery</b></center><p>This cemetery, named for Mexico's Patron Saint, Our Lady of Guadalupe, was established in 1913 as a public burial ground for residents of the Pharr Community. The Pharr townsite was laid out in 1909, and though ranch graveyards existed south of here, there were unavailable to newcomers. The earliest interment here, of Roberto de Leal, an infant, dates to 1913. Other burials include civic leaders, area pioneers and military veterans. The burial ground features religious statuary, curbing and interior fencing. The city of Pharr is the caretaker of the cemetery, and in 2003 joined volunteers of the Texas Main Street Program for a project to improve the burial ground.</p><p><center>Historic Texas Cemetery-2007</center></p>","atlas_number":"5507014165","latitude":26.200066743950945,"longitude":-98.18814605362728},
{"markernum":"1251","title":"Donna","indexname":"Donna","address":"","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594371","utm_north":"2894862","code":"cities and towns; agriculture, general; land surveys, land companies, promotional towns","year":"1986","rthl":"0","loc_desc":"Town square, Bus. Route US 83 (Hooks St.) at S. 8th, Donna","size":"18\"\" x 28\"\"","markertext":"Two East Texas men, T. J. Hooks and A. F. Hester, began developing this area for settlement in the late 1890s.  Through formation of the La Blanca Agricultural Company, they set up farms and irrigation systems and advertised the area's favorable climate and resources.  In 1904, when a rail line was built here, they founded the town of Donna, named for T. J. Hooks daughter.  Ed Ruthven opened the first store and, in 1908, the town incorporated with R.  P. Boeye as mayor. Since the earliest days of the 20th century, Donna has developed as one of the leading cities of the Rio Grande Valley.  Texas Sesquicentennial 1836 - 1986","atlas_number":"5215001251","latitude":26.17007681098953,"longitude":-98.05568474278907},
{"markernum":"1253","title":"Donna Public Schools","indexname":"Donna Public Schools","address":"","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"593824","utm_north":"2884615","code":"educational topics","year":"1986","rthl":"0","loc_desc":"at Runn School, 0.5 mile west of FM 493 on US 281, Runn","size":"18\"\" x 28\"\"","markertext":"The present school system for the town of Donna can be traced to a 1904 school in the Runn community (6 mi. S).  Classes were first held in the home of A. F. Hester, a founder of Donna.  The earliest school for the new town opened in 1908.  Teachers held classes in a one-room structure and a store building until completion of the first schoolhouse in 1911.  The Donna School District was set up in 1919.  Since then, several early area schools, including Runn in 1972, have merged with Donna.  It is now one of Hidalgo County's leading educational systems.","atlas_number":"5215001253","latitude":26.077597677204135,"longitude":-98.06189685478968},
{"markernum":"2468","title":"Hidalgo County","indexname":"Hidalgo County","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583614","utm_north":"2909258","code":"counties","year":"1936","rthl":"0","loc_desc":"Courthouse Lawn, Cano & US 281 Bus., Edinburg","size":"1936 Centennial - Highway Marker (pink granite)","markertext":"Formed from Starr and Cameron counties.       Created January 24, 1842.      Organized April 7, 1854.      Named in Honor of Miguel Hidalgo y Costilla -- 1753-1811  Mexican Patriot      County Seat, 1852, Edinburgh, name changed February 7, 1861, to Hidalgo.        Moved to present site, then called Chapin, October 12, 1908.        Name changed to Edinburg, February 3, 1911.","atlas_number":"5215002468","latitude":26.300718290533805,"longitude":-98.16238301567323},
{"markernum":"2641","title":"Indiana, Nebraska and Minnesota National Guards","indexname":"Indiana, Nebraska and Minnesota National Guards","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"603817","utm_north":"2893262","code":"military topics","year":"1960","rthl":"0","loc_desc":"Texas A & M experimental station, from Weslaco, take US 83 business east 1.5 miles.","size":"State Approved","markertext":"Indiana National Guard      In honor of the officers and men of the Indiana National Guard stationed at Llano Grande, Texas 1916-1917.  One field artillery battalion, 2 field hospital companies, 3 infantry regiments, 2 ambulance companies, 1 sanitary company, 1 signal company.  Total troops 3702.    Nebraska National Guard.        Erected in honor of the officers and men of the Nebraska National Guard stationed at Llano Grande, Texas 1916-1917.  3 infantry regiments, 1 signal company, 2 sanitary companies, 1 field hospital, 1 machine gun company.  Total troops 2153.    Minnesota National Guard.        Erected in honor of the officers and men of the Minnesota National Guard stationed at Llano Grande, Texas, 1916-1917.  3 infantry regiments, 1 field artillery regiment.  Total troops 5117.  (1966)","atlas_number":"5215002641","latitude":26.154980762154732,"longitude":-97.96130398114911},
{"markernum":"2773","title":"John Closner Home","indexname":"Closner, John, Home","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583619","utm_north":"2909443","code":"houses, residential buildings; outlaws; sheriffs; law enforcement","year":"1966","rthl":"1","loc_desc":"Bus. US 281, Hildago Co. Museum, Edinburg","size":"16\"\" x 12\"\"","markertext":"Built 1887, enlarged 1888.  Social center.  Had county's only piano.      While pioneering in farming and irrigation, Closner also brought law and order to the outlaw-plagued county.  After 1884-1890 service as deputy, was elected sheriff in 1890-- the ninth in 7 years.  Without using six-gun or killing a man, tamed gangs of rustlers and bandits.  When he retired in 1912, he had enforced six-shooter law (no guns worn)-- a border first.  Recorded Texas Historic Landmark, 1966","atlas_number":"5215002773","latitude":26.302388273108065,"longitude":-98.16232092601172},
{"markernum":"2872","title":"Juan Davis Bradburn","indexname":"Bradburn, Juan Davis","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566890","utm_north":"2893345","code":"Latin American topics; Texas Revolution, Republic of Texas; military topics","year":"1994","rthl":"0","loc_desc":"from Mission, take FM 1016 south about 2 mi, in La Lomita Park","size":"18\"\" x 28\"\"","markertext":"John Davis Bradburn (1787-1842) was born in Virginia and reared in Kentucky.  He entered Mexico in 1817 with Francisco Mina's army to help upset Spanish colonial forces in the War of Independence.  He became a naturalized Mexican citizen and in 1821 married into an aristocratic family.  Bradburn hired Henry Austin to operate a steamboat on the Rio Grande in 1828.  Best known as the Mexican commander at the Anahuac disturbances in 1830-32, he was promoted to general in 1832, and died in 1842. The exact location of his grave is unknown; he reportedly is buried on the hill nearby.  (1996)","atlas_number":"5215002872","latitude":26.157920884994834,"longitude":-98.33073110483483},
{"markernum":"3280","title":"McCook Community","indexname":"McCook Community","address":"","city":"McCook","county":"Hidalgo","utm_zone":"14","utm_east":"560661","utm_north":"2928840","code":"cities and towns; Polish immigrants/immigration","year":"1978","rthl":"0","loc_desc":"Immaculate Conception Church, FM 2058, McCook","size":"18\"\" x 28\"\"","markertext":"Named for a local storekeeper, this community was settled by descendants of the pioneers who in 1854 founded Panna Maria, Texas, the oldest Polish colony in the United States.  Urban Kotzur, his son Leon, and their neighbor Frank Prukop bought land in this area in 1925 and the Kotzur family was the first to move here in 1926.  Soon other families arrived to clear the brush land and begin cultivation.  The farming village had a post office for several years during the 1930s.  A school was started in 1929, and Immaculate Conception Catholic Church was built in 1950.  (1979)","atlas_number":"5215003280","latitude":26.478679655074313,"longitude":-98.39137994704018},
{"markernum":"4239","title":"Relampago Ranch","indexname":"Relampago Ranch","address":"","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608051","utm_north":"2885516","code":"ranches/ranching; ghost towns","year":"1980","rthl":"0","loc_desc":"from Mercedes, take FM 491 south about 3 miles, then go west on US 281 about 1.2 miles","size":"18\"\" x 28\"\"","markertext":"Originally part of a Spanish land grant, Relampago (lightning) Ranch community lay along the stage and military route from Rio Grande City to Brownsville.  In 1852 Thaddeus Rhodes (1828-1904) acquired acreage here when he came as Hidalgo county clerk.  Later he served as commissioner and judge.  He and Jose Maria Mora (1824-1884), who bought adjoining land about 1856, helped bring economic and social stability.  Mora and later his son Melchor, a deputy sheriff and Texas Ranger, farmed, ranched and had the only general store in the area.  Descendants still live on the property.  (1980)","atlas_number":"5215004239","latitude":26.084737392694162,"longitude":-97.91959178720393},
{"markernum":"5474","title":"Thomas Walter Jones","indexname":"Jones, Thomas Walter","address":"","city":"Alamo","county":"Hidalgo","utm_zone":"14","utm_east":"586397","utm_north":"2885163","code":"scientific topics; geology; land surveys, land companies, promotional towns; military topics","year":"1993","rthl":"0","loc_desc":"near Intersection of US 281 & FM 907, in Santa Anna National Wildlife Refuge, (on trail), south of Alamo","size":"Grave Marker","markertext":"The Treaty of Guadalupe Hidalgo ended the Mexican War in 1848 and designated the main channel of the Rio Grande as the boundary between the U.S. and Mexico.  Major William Emory led the border survey (1849-53).  Young Washington D.C. surveyor Thomas W. Jones joined Emory's survey effort at El Paso in 1850. While serving as assistant surveyor of the Lower Rio Grande Survey party, Jones drowned nearby on July 23, 1853, and was buried here on Dr. Eli T. Merriman's ranch.  Recorded - 1994","atlas_number":"5215005474","latitude":26.083008988128014,"longitude":-98.13611267352202},
{"markernum":"13006","title":"First Christian Church of Weslaco","indexname":"First Christian Church of Weslaco","address":"205 W Sixth St","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"600730","utm_north":"2893256","code":"Christian (Disciples of Christ) denominations; churches","year":"2003","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"When the Weslaco Townsite Company platted the new town in 1919, it offered city lots to representatives of Presbyterian, Baptist, Methodist and Christian denominations. They held services in a community house, with each responsible for one Sunday a month. Members of each denomination soon formed separate churches. On December 16, 1921, First Christian Church organized with 44 charter members. Over the years, it has remained on its original site but grown in service and facilties. Programs have included leadership in a federation of church women to establish a well-baby clinic. Today, the church continues to reflect the ideals of its founding in service to its members and the community. (2005)","atlas_number":"5215013006","latitude":26.15514601997419,"longitude":-97.99218621108697},
{"markernum":"13451","title":"Asociacion del Cementerio La Piedad","indexname":"Asociacion del Cementerio La Piedad","address":"1801 Wichita Ave","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"575749","utm_north":"2896168","code":"graveyards; Mexican immigrants/immigration","year":"2005","rthl":"0","loc_desc":"1801 Wichita Avenue, N of Miller Airport","size":"Medallion and 12\"\" x 6\"\" Name and Date plaque","markertext":"Asociacio del Cementerio la Piedad  Established 1895  Historic Texas Cemetery - 2005","atlas_number":"5507013451","latitude":26.18297015006114,"longitude":-98.24193326480382},
{"markernum":"14400","title":"St. Joan of Arc Catholic Church","indexname":"Saint Joan of Arc Catholic Church","address":"109. S. Illinois Ave.","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"567350","utm_north":"2899706","code":"churches; Roman Catholic denomination","year":"2008","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"<center><b>Saint Joan of Arc Catholic Church</b></center><p>In 1921, Saint Joan of Arc Catholic Church was established as a mission parish of Our Lady of Mercy Church in Mercedes, which had previously ministered to area Catholics. The church became a full parish in 1929. From 1940 to 1968, the church operated a parochial school which educated a multitude of students, many of whom became noted professionals. The church has formed a number of other organizations, through which the congregation has ministered to the needy. In addition, the church organized the St. Pius X and San Martin de Porres Churches. Today, the Church continues to be a leading Catholic institution in South Texas. (2008)</p>","atlas_number":"5507014400","latitude":26.215332889877295,"longitude":-98.32579833145171},
{"markernum":"2706","title":"Jackson Ranch Church","indexname":"Jackson Ranch Church","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581682","utm_north":"2886193","code":"Methodist (Methodist Episcopal and United Methodist) denomination; ranches/ranching; churches","year":"1983","rthl":"0","loc_desc":"from Pharr take US 281 south about 7.25 miles to marker, about 1 mile east of international bridge","size":"18\"\" x 28\"\"","markertext":"This fellowship was founded in 1874 by the Rev. Alexander H. Sutherland (1848-1911), an early Methodist missionary, on Juan Manuel de La Vina's El Capote Ranch.  In 1883 the congregation began meeting near this site on the Jackson Ranch when owner Martin Jackson donated the land.  He later built a small chapel for their use.  In 1910 most of the church members moved to the new city of McAllen, and only a few families continued to worship here. As one of the first Protestant congregations in Hidalgo County, this church has continued to serve area residents. (1983)","atlas_number":"5215002706","latitude":26.092583215387876,"longitude":-98.18318966170524},
{"markernum":"4545","title":"San Juan Townsite","indexname":"San Juan Townsite","address":"","city":"San Juan","county":"Hidalgo","utm_zone":"14","utm_east":"584089","utm_north":"2896941","code":"cities and towns","year":"1984","rthl":"0","loc_desc":"Fifth & standard (SW corner), San Juan","size":"18\"\" x 28\"\"","markertext":"The town of San Juan was established in 1910 with the sale of 406 acres of land to the San Juan Townsite Co., by area entrepreneur John Closner, for whom the town was named.  Located on the rail line, San Juan quickly developed a business district along Fifth Street.  At this site in 1911, the city's first two-story building was erected.  It housed the San Juan State Bank until 1918 and served a variety of business, including the district irrigation office, until its partial demolition more than 60 years later. The only remaining section of the structure houses the city library.  (1984)","atlas_number":"5215004545","latitude":26.189485477099854,"longitude":-98.15842646462906},
{"markernum":"12950","title":"Sam and Marjorie Miller House","indexname":"Miller, Sam and Marjorie, House","address":"707 N 15th St","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576460","utm_north":"2899277","code":"houses, residential buildings; Tudor Revival (Architectural style)","year":"2002","rthl":"1","loc_desc":"","size":"16\"\" x 12\"\"","markertext":"Samuel Lynn and Marjorie Williams Miller were early McAllen leaders. Sam had interests in a nursery, banking and real estate, and was co-owner of the Hidalgo International Bridge. In 1930, he donated 109 acres of land to establish the municipal airport, which later became McAllen Miller International Airport. Marjorie was a civic leader active in the Order of the Eastern Star. The Miller home, inspired by a trip to England, was built in 1937. Robert Vogler designed the English Tudor Revival house based on Marjorie's plans. The work of local artisans is evident in the Austin Cordova stonework, half-timbered gables and gumwood detailing inside and out.  Recorded Texas Historic Landmark - 2002","atlas_number":"5215012950","latitude":26.21100305118492,"longitude":-98.23463487915441},
{"markernum":"546","title":"Brushwood Cemetery","indexname":"Brushwood Cemetery","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"585662","utm_north":"2909701","code":"graveyards; Spanish immigrants/immigration; German immigrants/immigration; Irish immigrants/immigration","year":"","rthl":"0","loc_desc":"Schunior St. (FM 2128), 3 mi. east of US 281, Edinburg","size":"18\"\" x 28\"\"","markertext":"Brushwood Cemetery was established as a municipal burial ground for the town of Chapin (now Edinburg) in 1913, five years after the town's founding.  The earliest known burial here was that of Antonia Hernandez de Ramos, who died in 1913.  Older graves dating to 1898 were relocated here from El Granjeno Cemetery near the town of Mission.  More than 1,000 graves are located here.  Tombstones bear Anglo, Spanish, German, and Irish surnames and document the diversity of peoples that helped build Edinburg and other communities in the vicinity.","atlas_number":"5215000546","latitude":26.304596653619704,"longitude":-98.14183920649745},
{"markernum":"3883","title":"Our Lady of Guadalupe Catholic Church","indexname":"Our Lady of Guadalupe Catholic Church","address":"6th Dunlap Streets, Mission","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567197","utm_north":"2899311","code":"eccesiastical buildings; Mission (Architectural style); Roman Catholic denomination; churches","year":"1990","rthl":"1","loc_desc":"6th Dunlap Streets, Mission","size":"16\"\" x 12\"\"","markertext":"This church was established in 1899, as the first mission of the historic La Lomita Church (5 miles south).  Originally known as Our Lady of the Mission (Nuestra Senora de la Mission), it was renamed Our Lady of Guadalupe (Nuestra Senora de Guadalupe) in 1927 when this structure was built.  The Mission revival inspired structure features a four-story tower capped by a domed belfry; mission parapets; arched windows; and elaborate limestone detailing.  Recorded Texas Historic Landmark - 1990.","atlas_number":"5215003883","latitude":26.2117736202556,"longitude":-98.32735034581603},
{"markernum":"4145","title":"Quinta Mazatlan, Home of Jason Matthews","indexname":"Quinta Mazatlan, Home of Jason Matthews","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576818","utm_north":"2895582","code":"journalists; houses, residential buildings; design and construction; writers and poets","year":"1985","rthl":"0","loc_desc":"600 Sunset, McAllen","size":"18\"\" x 28\"\"","markertext":"One of the larger adobe homes in the state, Quinta Mazatlan was designed and built by Jason Chilton Matthews (1887-1964) during the late 1930s.  Adobe blocks used in construction were made at this site.  A composer, writer, and adventurer, Matthews was known for his eccentric ways.  During the last few years of their lives, Jason and his wife Marcia (1891-1963) edited and published the \"\"American Mercury\"\" magazine from here.  Begun in 1924, the magazine was a leading conservative publication which expressed strong pro-American views.  (1985)","atlas_number":"5215004145","latitude":26.17762251463534,"longitude":-98.23127060423475},
{"markernum":"14484","title":"Weslaco High School","indexname":"Weslaco High School","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"601205","utm_north":"2893094","code":"educational topics; educational buildings","year":"2008","rthl":"1","loc_desc":"S. Iowa St. at 7th St.","size":"18\"\" x 28\"\"","markertext":"<center><b>Weslaco High School</b></center><p>Weslaco Independent School District formed in 1921, when residents petitioned the Texas Legislature to separate from Donna ISD. Upon the district's creation, board members planned for the first school building, designed by San Antonio architect Harvey P. Smith and completed by Brownsville's H.L. Fitch and Co. by Feb. 1923. The one-story school building with raised basement is built of reinforced concrete and hollow tile, faced with dark Butler brick and lighter bands near the floorline. The recessed central entry has a prominent door surround and pediment. The structure and adjacent Weslaco Junior High were threatened with demolition before being rehabilitated for the 2006-07 school year.</p><p><center>Recorded Texas Historic Landmark-2009</center></p>","atlas_number":"5507014484","latitude":26.15365011071942,"longitude":-97.98744700566327},
{"markernum":"3272","title":"McAllen Post Office","indexname":"McAllen Post Office","address":"351 South Main Street","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576651","utm_north":"2897991","code":"post office; buildings; Spanish Colonial Revival (Architectural style)","year":"1986","rthl":"1","loc_desc":"351 South Main Street, McAllen","size":"16\"\" x 12\"\"","markertext":"Built in 1935, this was the sixth location of the McAllen Post Office after its creation in 1907.  The facility was dedicated on January 22, 1936, and served as a postal facility until 1957.  Since 1958, the building has been used for a variety of purposes, including Federal and city office space.  The Spanish colonial revival structure features a baroque frontispiece around the front door, corbelled cornice, and red tile roof.  Recorded Texas Historic Landmark - 1986.","atlas_number":"5215003272","latitude":26.19938183828018,"longitude":-98.23279922028276},
{"markernum":"1389","title":"Edinburg Junior College Auditorium","indexname":"Edinburg Junior College Auditorium","address":"N Seventh and McEntyre","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583199","utm_north":"2909525","code":"buildings; educational buildings; educational topics; design and construction; Gothic Revial (Architectural style)","year":"1989","rthl":"1","loc_desc":"N. Seventh and McIntyre, Edinburg","size":"16\"\" x 12\"\"","markertext":"Designed by the Austin architectural firm Giesecke and Harris, this structure was built in 1926 to serve the newly-created Edinburg Junior College.  In addition to serving the college and succeeding educational institutions, the auditorium has also been used by the city as a cultural center.  The Gothic revival style building features ogee-arched windows and ornamental stonework. It is a fine example of early 20th century educational buildings.","atlas_number":"5215001389","latitude":26.30315311777162,"longitude":-98.16652275303117},
{"markernum":"3661","title":"Oblate Park","indexname":"Oblate Park","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567825","utm_north":"2899853","code":"parks; Roman Catholic denomination","year":"1984","rthl":"0","loc_desc":"11th and Francisco, Mission","size":"18\"\" x 28\"\"","markertext":"In 1916 the city of Mission entered into a 99-year lease agreement with the Missionary Society of Oblate Fathers for the purpose of creating a public park for the use and benefit of all its citizens.  Named for this society of Catholic priests, which, six years earlier, had sold land for the townsite of Mission, Oblate Park has been the scene of many band concerts, Memorial Day celebrations, and Fourth of July festivities.  As the center of an early major addition to Mission, it became the focus of social activity for the developing city.  (1984)","atlas_number":"5215003661","latitude":26.216637773281068,"longitude":-98.32103594560635},
{"markernum":"4478","title":"Saint Paul Lutheran Church","indexname":"Saint Paul Lutheran Church","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"578004","utm_north":"2900032","code":"Lutheran denomination; churches; German immigrants/immigration","year":"1996","rthl":"0","loc_desc":"300 Pecan, McAllen","size":"18\"\" x 28\"\"","markertext":"Organized in Pharr in 1916 by the Rev. Paul Birkman and five charter members, St. Paul Lutheran Church moved to McAllen in 1917.  Early worship service, conducted in German, were held in the First Methodist Church.  The Lutherans purchased the former McAllen Christian Church building in 1919 and met there until the 1940s.  A brick building was constructed to house both the church and the parochial school established in 1943.  A 20-acre site was purchased here in 1952, and a new sanctuary and school were erected.  The church serves the area with several programs.  (1996)","atlas_number":"5215004478","latitude":26.217736673805355,"longitude":-98.21913506755146},
{"markernum":"665","title":"Camp Llano Grande","indexname":"Camp Llano Grande","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"603817","utm_north":"2893262","code":"military topics; forts; military topics","year":"1986","rthl":"0","loc_desc":"2415 E. US Business Route 83, Weslaco","size":"18\"\" x 28\"\"","markertext":"Occupied in 1916-17 by Indiana, Nebraska, Minnesota and North Dakota National Guard units, Camp Llano Grande was one of a line of encampments established along the Rio Grande in response to Mexican bandit raids into the U.S.  Covering over 200 acres, it included a headquarters building, commissary, and recreational facilities.  South of the railroad tracks were parade grounds, tent encampments, and stock pens.  The camp was abandoned in March 1917, one month before the U.S. entered World War I, and former Llano Grande troops were called for war service in France.  Texas Sesquicentennial 1836 - 1986","atlas_number":"5215000665","latitude":26.154980762154732,"longitude":-97.96130398114911},
{"markernum":"1838","title":"First Presbyterian Church of Hidalgo","indexname":"First Presbyterian Church of Hidalgo","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576636","utm_north":"2898358","code":"women, women's history topics; churches; Presbyterian denomination","year":"1994","rthl":"0","loc_desc":"104 S. 4th Street, McAllen","size":"18\"\" x 28\"\"","markertext":"This church began with McAllen's first Presbyterian worship service, held by the Rev. M.W. Doggett in a local lumberyard in 1908.  Dr. W. A. King and George Pollack were first elders.  Although adversely affected by the Mexican Revolution (1909-1919) the church was sustained by its Women's Society, formed in 1909.  The first sanctuary, built here in 1910, was a prominent landmark in McAllen's early history.  A fellowship hall was added in 1949, and education building in 1953, and a new sanctuary in 1959-60.  This congregation continues to serve the community with a variety of programs. (1995)","atlas_number":"5215001838","latitude":26.202696207180104,"longitude":-98.23292763176491},
{"markernum":"2996","title":"La Loma Ranch Headquarters","indexname":"La Loma Ranch, Headquarters","address":"","city":"Edinburg vicinity","county":"Hidalgo","utm_zone":"14","utm_east":"586973","utm_north":"2934099","code":"ranches/ranching; houses, residential buildings","year":"1963","rthl":"1","loc_desc":"from Edinburg, go 10 miles north on Hwy 281.  (no access-private)","size":"Medallion only","markertext":"Medallion only, no text. There is a private marker at the site.","atlas_number":"5215002996","latitude":26.524789695919484,"longitude":-98.12705021703064},
{"markernum":"4830","title":"Site of McAllen Hospitals","indexname":"McAllen Hospitals, Site of","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576403","utm_north":"2897696","code":"hospitals; medical topics and health professionals","year":"1994","rthl":"0","loc_desc":"Main and Houston at McAllen City Hall, McAllen","size":"27\"\" x 42\"\"","markertext":"The city of McAllen was founded in 1904 and incorporated in 1911.  The first medical practitioner was Dr. J. B. F. McMillan who arrived in 1906.  Dr. Frank E. Osborn built a two story building in 1918 with a pharmacy on the first floor and doctor's offices upstairs.  Dr. Carlos Balli, the first Hispanic to open a practice in McAllen, began in 1920 and was noted for making house calls on horseback.  A hospital building was erected in 1920.  Dr. J. M. Doss combined his home with an office and hospital.  The two story structure featured a solarium on both ends of the ground floor, with a surgical facility and hospital beds on the upper floor.  In 1925 the first municipal hospital was built on South Broadway with beds for 25 patients, but was soon outgrown.  A new hospital here on Main Street was completed in 1928.  The two buildings were connected with a covered passageway.  Increased population caused an addition to be built in 1954.  More growth and medical advances demanded new additions in 1960, 1967 and 1973.  Demolished in 1993, the hospital building that stood here for decades was a significant part of the development of health care in McAllen.  Other medical facilities have been added to meet the needs of the area.  (1996)","atlas_number":"5215004830","latitude":26.1967315573165,"longitude":-98.23529867560737},
{"markernum":"4836","title":"Site of Monte Christo","indexname":"Monte Christo, Site of","address":"","city":"Alton","county":"Hidalgo","utm_zone":"14","utm_east":"569856","utm_north":"2915545","code":"settlements; land surveys, land companies, promotional towns; ghost towns","year":"1985","rthl":"0","loc_desc":"FM 1925 (Monte Christo Road), east of FM 2993 (Conway Avenue-Cantu Road)","size":"18\"\" x 28\"\"","markertext":"<center>Site of</center> <center>Monte Christo</center> <center>(2.5 mi. North)</center> <p>One of the towns that sprang up in the Rio Grande Valley in the early 20th century, Monte Christo was platted in 1909 by the Melado Land Company.  Among the first settlers were Otto Woods (1882-1956), who managed the townsite, and Virgil Lott (1878-1960), who published a newspaper called \"\"The Hustler\"\".  At its height, Monte Christo had a bank, school, railroad station, cotton gin, two hotels, and a population of 1500.  Residents began to move away during the bandit raids of 1914-1916.  Others left when the water supply proved inadequate.  By 1934 Monte Christo was a ghost town.</p> <div align=\"\"right\"\">(1985)</div>","atlas_number":"5215004836","latitude":26.358220644823227,"longitude":-98.29985564654444},
{"markernum":"16644","title":"Weslaco City Cemetery","indexname":"Weslaco City Cemetery","address":"","city":"","county":"Hidalgo","utm_zone":"14","utm_east":"601116","utm_north":"2892697","code":"","year":"2010","rthl":"0","loc_desc":"SE corner of E. Illinois at E. 10th","size":"18\"\" x 28\"\"","markertext":"THE CITY OF WESLACO, NAMED FOR THE W. E. STEWART LAND COMPANY, WAS FOUNDED IN DECEMBER 1919. IN 1921, THE CITY ESTABLISHED A CEMETERY HERE, OUTSIDE THE ORIGINAL TOWNSITE. THE FIRST GRAVE IS THAT OF REUBEN W. WARREN (d. 1921). ALSO BURIED HERE ARE WESLACO CITY FOUNDERS EDMOND COOPER COUCH (1876-1944) AND ROBERT LEE REEVES (1871-1938). H.E. BENNETT PLATTED THE BURIAL GROUND IN 1922, AND HE PLATTED AN ADDITION IN 1926. THROUGHOUT THE CEMETERY, GRAVE MARKERS INDICATE MILITARY SERVICE AND FRATERNAL ORGANIZATION MEMBERSHIP. THE CITY OF WESLACO MAINTAINS THE BURIAL GROUND OF MORE THAN 6,000 GRAVESITES.","atlas_number":"5507016644","latitude":26.15007214959414,"longitude":-97.98836824652915},
{"markernum":"1948","title":"Former Hidalgo Post Office","indexname":"Hidalgo Post Office, Former","address":"First & Flora Streets, Hidalgo","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573731","utm_north":"2886796","code":"post office","year":"1965","rthl":"1","loc_desc":"First & Flora Streets, Hidalgo","size":"14\"\" x 9\"\"","markertext":"Oldest in existence. Built 1889 to house a general merchandise store.  One part was reserved for the town's postal service, then in its 32nd year, served until 1913.  Store owner William Odell, his wife Josephine, and Gumaro, son of co-owner Desiderio Rodriguez, were Postmasters.  Recorded Texas Historic Landmark, 1965","atlas_number":"5215001948","latitude":26.098455945583893,"longitude":-98.26265904702616},
{"markernum":"384","title":"Bessie","indexname":"Bessie","address":"900 S. 23rd","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"575257","utm_north":"2897653","code":"boats, ships, ferries, barges, and other marine vessels; churches; Roman Catholic denomination","year":"1975","rthl":"0","loc_desc":"St. Joseph the Worker Church","size":"18\"\" x 28\"\"","markertext":"The steamboat \"\"Bessie\"\", last of the Mifflin Kenedy-Richard King Rio Grande shipping fleet of the mid-1800s, carried this 400-pound bell instead of a whistle. After its final trip on the river in 1902, the bell \"\"Bessie\"\" was used until 1909 on John Closner's plantation east of Hidalgo. A dispute over its ownership delayed the purchase of \"\"Bessie\"\" by Sacred Heart Catholic Church in McAllen, and saved it when a fire destroyed (1924) the church. In 1926 it was placed in the rebuilt church. Cracked in 1937, and recast from original metal, the bell was later moved here to St. Joseph the Worker Church. (1975)","atlas_number":"5215000384","latitude":26.196403827693093,"longitude":-98.24677044426755},
{"markernum":"747","title":"Casa de Palmas","indexname":"Casa de Palmas","address":"101 N Main St.","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576574","utm_north":"2898486","code":"inns, hotels, motels","year":"1979","rthl":"1","loc_desc":"101 N Main St.","size":"16\"\" x 12\"\"","markertext":"This site was a city park with antelope, javelina, and deer before a group a businessmen decided McAllen needed a hotel to serve as a business and social center.  The Casa De Palmas, a three-story structure with a red tile roof built around a center patio and twin towers, was erected here in 1918.  It served as a refuge for many area residents during the severe 1919 hurricane.  The hotel was rebuilt in the original style after a 1973 fire.  Recorded Texas Historic Landmark - 1979  Incise in base: Restored by La Posada Motor Hotel","atlas_number":"5215000747","latitude":26.20385520091645,"longitude":-98.2335405960016},
{"markernum":"4751","title":"Site of Casa de Palmas","indexname":"Casa de Palmas, Site of","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576574","utm_north":"2898486","code":"inns, hotels, motels","year":"1979","rthl":"0","loc_desc":"101 N. Main St., McAllen","size":"18\"\" x 28\"\"","markertext":"The town of McAllen began developing after the arrival of the railroad in 1905.  Introduction of an irrigation system made vegetable farming possible.  Soon there was a hotel, a grocery store, a Presbyterian church, a bank, and a weekly newspaper.  In 1916 after bandits caused border trouble 12,000 soldiers were sent here to restore law and order.  Business boomed with the increased population.  Among the new facilities was the Casa de Palmas Hotel, opened in 1918.  This fine hotel served as a business, social, and civic center for the Rio Grande Valley. (1979)  Incise in base: Restored by La Posada Motor Hotel","atlas_number":"5215004751","latitude":26.20385520091645,"longitude":-98.2335405960016},
{"markernum":"1156","title":"1st North Dakota Infantry","indexname":"North Dakota Infantry, 1st","address":"South Ohio Avenue and West 10th Street","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608817","utm_north":"2891887","code":"military topics","year":"1960","rthl":"0","loc_desc":"","size":"State-approved marker","markertext":"Erected 7 April 1960 In recognition of 1007 officers and enlisted men of the 1st North Dakota Infantry, North Dakota National Guard which occupied this area as a camp site 1916-1917.     HISTORY Organized as 1st Dakota Infantry 1883 Redesignated 1st North Dakota Infantry 1885   FEDERAL SERVICE   Span.-Amer. War & War of Insurrection 1898-1899  Mexican Border Service 1916-1917  REDESIGNATED 164TH INFANTRY  WWI - - AEF - FRANCE   1917-1918  WWII - Pacific Theatre of Operations 1941-1945   Korean Conflict - Camp Rucker, Alabama 1951-1953     This regiment, as a part of the Americal Division, was the first United States Army component to take the offensive in World War II - Guadalcanal, 13 October 1942. Converted to 164th Engineer Group NDAK NG 1955","atlas_number":"5215001156","latitude":26.14219776008758,"longitude":-97.91140088350633},
{"markernum":"1421","title":"El Horcon Tract and Rio Rico","indexname":"El Horcon Tract and Rio Rico","address":"","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"610951","utm_north":"2885425","code":"Latin American topics; geology; land surveys, land companies, promotional towns; Mexican War; water topics","year":"1993","rthl":"0","loc_desc":"US 281, .5 Mi E of intersection of US 281 and FM 491 (S. Side of Rd), Mercedes","size":"27\"\" x 42\"\"","markertext":"The Treaty of Guadalupe Hidalgo which ended the Mexican War (1846-48) designated the main channel of the Rio Grande as the Mexico-U.S. boundary.  Disputes arising from frequent changes in the river's course led to the Treaty of 1884 which recognized only those river diversions resulting from natural occurences.  The International Boundary Commission was established in 1889 to administer the Treaty of 1884.        In 1906 the American Rio Grande Land and Irrigation Company dug an unauthorized canal about two miles south of here which altered the natural course of the Rio Grande.  As a result, a 419-acre section of U.S. property called El Horcon tract was isolated south of the river.  Although still U.S. territory according to the Treaty of 1884, the tract and the popular gambling and resort community of Rio Rico which flourished there during the 1920s and 1930s became increasingly subject to Mexican administration and jurisdiction.      After the U.S. granted Mexico territorial rights over El Horcon tract and Rio Rico in 1970, a native of Rio Rico sued the U.S. government to guarantee his U.S. citizenship.  This lawsuit began an eight-year legal battle that eventually led to U.S. citizenship for about 200 people born in Rio Rico prior to 1970. (1994)","atlas_number":"5215001421","latitude":26.08369582260506,"longitude":-97.89060654910334},
{"markernum":"2278","title":"Gregg  Wood Home","indexname":"Wood, Gregg, Home","address":"1215 Doherty","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567637","utm_north":"2900161","code":"houses, residential buildings; local law enforcement officer; Bungalow (Architectural style); municipal official","year":"1984","rthl":"1","loc_desc":"1215 Doherty, Mission","size":"16\"\" x 12\"\"","markertext":"David Gregg Wood, Sr. (1876-1965) originally came to the valley in 1893 and settled in Mission in 1908.  Wood, who served as mayor, city commissioner, and president of the First National Bank, led the way for many improvements in the area's water, sewage, and irrigation systems.  This bungalow style home was built for his family in 1917, with the second story added in the 1920s.  The mission landmark features an open gable porch supported on broad piers.  Recorded Texas Historic Landmark - 1984.","atlas_number":"5215002278","latitude":26.21942756551457,"longitude":-98.32290172253292},
{"markernum":"2472","title":"Hidalgo-Reynosa Bridges","indexname":"Hidalgo-Reynosa Bridges","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"572804","utm_north":"2886655","code":"bridges","year":"1988","rthl":"0","loc_desc":"US 281 Spur at its terminus at the Rio Grande, Hidalgo","size":"27\"\" x 42\"\"","markertext":"At the time of the formation of Hidalgo County in 1852, the village located here, originally named Edinburgh, became the new county seat.  A ferry service was operating between the village and Reynosa, Mexico.  By 1861 the town's name was changed to Hidalgo, and regular ferry service was inaugurated in 1910 by Crisoforo Vela (1856-1932).  First using rowboats and, later, raft-like conveyances, the ferry continued in operation until Joe Pate erected a bridge here in 1926.       The 1926 suspension bridge was damaged by floods in 1933.  Although rebuilt and strengthened, it fell into the river and was destroyed in 1939 after cable anchors on the U.S. side failed to hold.  A second suspension bridge was erected the following year and purchased by the city of McAllen in 1960.  A four-lane prestressed concrete bridge was opened to traffic on June 1, 1967. The suspension bridge was removed for salvage in 1971.  Construction of an additional four-lane bridge was completed in 1988.      For over six decades, the Hidalgo-Reynosa bridges, operated jointly by McAllen, Hidalgo, and Mexican interests since 1960, have facilitated transportation and fostered international cooperation and friendship between Texas and Mexico. (1989)","atlas_number":"5215002472","latitude":26.097229944692796,"longitude":-98.2719367167117},
{"markernum":"2542","title":"Home of William Jennings Bryan","indexname":"Bryan, William Jennings, Home of","address":"1321 E 2 Mile Ln","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"569412","utm_north":"2902626","code":"writers and poets","year":"1936","rthl":"0","loc_desc":"nw cor Mile 2 North Rd and Bryan Rd","size":"1936 Centennial - Subject Marker (gray granite)","markertext":"Once the lands of the Mission of the Oblate Fathers, this property (160 acres) was owned by Bryan from 1910 to 1916.  While residing here he wrote many articles and engaged in a magazine debate with Senator Albert J. Beveridge.","atlas_number":"5215002542","latitude":26.24159903906683,"longitude":-98.30500134603624},
{"markernum":"3140","title":"Louisiana-Rio Grande Canal Company","indexname":"Louisiana-Rio Grande Canal Company","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"579794","utm_north":"2885972","code":"agriculture, general; land surveys, land companies, promotional towns; water topics","year":"1994","rthl":"0","loc_desc":"US 281 south at Pharr-Reynosa International Bridge, Pharr","size":"27\"\" x 42\"\"","markertext":"Wisconsin native John Closner established the first steam-powered irrigation system in the lower Rio Grande Valley in 1895.  Closner successfully grew sugar cane and entered a sample for judging at the St. Louis World's Fair of 1904.  The award-winning sugar cane and Closner's promotion of the lower Rio Grande convinced a number of financiers and agriculturists to invest in the region's irrigation and development possibilities.        In 1909 H. N. Pharr, J. C. Kelly, John C. Conway, and A. W. Roth formed the Louisiana-Rio Grande (LRG) Canal Company to transform about 40,000 acres of arid land in Hidalgo County into productive farmland.  To do this the company built two pumping stations to divert water from the Rio Grande through an elaborate irrigation system to a planned community of small farmsteads.        The agricultural success of the LRG Canal Company, its successor the Hidalgo County Water Improvement District #2, and other similar operations in the region resulted in an influx of Anglo farmers and settlers from the midwestern U.S. into this mainly Hispanic region of Texas.  The bountiful harvests propelled the Rio Grande Valley to the forefront of Texas agriculture by the mid-20th century and earned the region a reputation as the \"\"winter garden\"\" of Texas. (1995)  Sesquicentennial of Texas Statehood 1845 - 1995 Sesquicentennial of Texas Statehood 1845-1995.","atlas_number":"5215003140","latitude":26.090693491445556,"longitude":-98.20208149481441},
{"markernum":"4986","title":"Southern Pacific Depot","indexname":"Southern Pacific Depot","address":"100 S. Bicentennial","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576054","utm_north":"2898391","code":"Colonial Revival; design and construction; railroad depots; railroads; Spanish Colonial Revival (Architectural style)","year":"1986","rthl":"1","loc_desc":"100 S. Bicentennial, McAllen","size":"16\"\" x 12\"\"","markertext":"The San Antonio & Aransas Pass (subsidiary of the Southern Pacific) Railway laid track south to the Rio Grande Valley and McAllen in 1927. This passenger depot, designed by railroad architect Leonard B. McCoy, opened in August that year. The structural tile building is stuccoed and detailed in Spanish colonial revival style. Passenger service ceased in 1952, and the building was occupied from 1953 to 1985 by public agencies, including the city police, jail, and municipal court.  Recorded Texas Historic Landmark - 1986.","atlas_number":"5215004986","latitude":26.20302510482047,"longitude":-98.23875069130445},
{"markernum":"5756","title":"Weslaco Water Tower","indexname":"Weslaco Water Tower","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"600900","utm_north":"2893993","code":"Federal programs; water topics","year":"1982","rthl":"0","loc_desc":"118-120 N. Kansas Avenue, Weslaco","size":"18\"\" x 28\"\"","markertext":"This ground level water storage reservoir was constructed in 1928, nine years after Weslaco was founded.  Built through the efforts of Mayor David E. Kirgan and City Water Commissioner William Detlef, it was a symbol of Kirgan's municipal reforms.  The facility was used until 1928 when work was begun on the adjacent overhead tank.  A project of the Works Progress Administration, it was completed in 1941 during the mayoralty of John L. Compere, Jr.  The site now serves as a reminder of Weslaco's early development as a progressive city.  (1982)","atlas_number":"5215005756","latitude":26.16178793225843,"longitude":-97.99042827635044},
{"markernum":"13004","title":"TexSun Corporation","indexname":"TexSun Corporation","address":"522 S Texas Blvd","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"600847","utm_north":"2893525","code":"agriculture, general; manufacturing; Business topics, general","year":"2003","rthl":"0","loc_desc":"522 S Texas Blvd","size":"18\"\" x 28\"\"","markertext":"The citrus industry was an integral part of the Rio Grande Valley economy in the 20th century. Grove development burgeoned in the 1920s and 1930s, but production outpaced early marketing capabilities; in 1932, 17 citrus associations formed the Rio Grande Valley Citrus Exchange. The exchange began production under the labels of TexSun and Tex Maid, and later had a box company, juicing and canning facilities, and a dehydration plant for citrus pulp-based cattle feed. It became a public corporation in 1956 and a subsidiary company in 1971. The plant ceased operations in 1991, but its economic impact on the Texas citrus industry, The Valley and Weslaco was significant. (2004)","atlas_number":"5215013004","latitude":26.15756642586927,"longitude":-97.99099486633615},
{"markernum":"2997","title":"La Lomita Chapel","indexname":"La Lomita Chapel","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566997","utm_north":"2893199","code":"eccesiastical buildings; churches; Roman Catholic denomination","year":"1964","rthl":"1","loc_desc":"from Mission, take FM 1016 south about 5 miles to La Lomita Park","size":"16\"\" x 12\"\"","markertext":"Lands for La Lomita (\"\"The Little Hill\"\") Mission came from the 1767 Spanish grant of Joseph A. Cantu, and were donated in 1861.  Used as farms and ranches, the lands supported the priests and their charities.  The original chapel, built in 1865 at a campsite on Brownsville-Roma Trail has been rebuilt or restored two or more times.  It was relocated at this present site in 1899.  The city of Mission (5 miles north), Texas, was named for this significant landmark.  Recorded Texas Historic Landmark - 1964.","atlas_number":"5215002997","latitude":26.15659766546989,"longitude":-98.32966810737574},
{"markernum":"1663","title":"First Baptist Church of Pharr","indexname":"First Baptist Church of Pharr","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"580834","utm_north":"2896028","code":"Baptist denomination; churches","year":"1994","rthl":"0","loc_desc":"400 W. Ridge Road, Pharr","size":"18\"\" x 28\"\"","markertext":"This church was established by seven charter members in 1913. The Rev. A. J. Seale served as first pastor.  Early worship services were held in a school building until 1916 when a sanctuary was built on land set aside by the Pharr Townsite Company.  A Sunday School, youth organization, and Women's Missionary Society were organized.  The congregation, which helped establish two local Hispanic churches, has added several facilities over the years.  A new sanctuary was built here in 1994.  First Baptist Church of Pharr continues to serve the area with a variety of outreach programs. (1995)","atlas_number":"5215001663","latitude":26.181429088933502,"longitude":-98.19105720365944},
{"markernum":"2621","title":"Immanuel Lutheran Cemetery","indexname":"Immanuel Lutheran Cemetery","address":"","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"607238","utm_north":"2893458","code":"graveyards; Lutheran denomination; Spanish immigrants/immigration; Russian immigrants/immigration; Norweigan settlement; German immigrants/immigration","year":"1988","rthl":"0","loc_desc":"W. end Anacultas Street, Mercedes","size":"18\"\" x 28\"\"","markertext":"This cemetery was established in 1913 on land give by the American Rio Grande Land and Irrigation Company to Immanuel Lutheran Church.  The cemetery has served Lutherans throughout the Rio Grande Valley.  The oldest grave is that of Wilhelm Schumacher, who died in 1911 and was reinterred here from his family farm when the cemetery was established.  Gravestones bear the names of many German, Norwegian, Finnish, and Russian settlers who immigrated to this area from the U.S. Midwest, as well as Hispanic names.  (1988)","atlas_number":"5215002621","latitude":26.1564993637391,"longitude":-97.92706517976099},
{"markernum":"2787","title":"John H. Shary Home","indexname":"Shary, John H., Home","address":"","city":"","county":"Hidalgo","utm_zone":"14","utm_east":"572122","utm_north":"2904801","code":"governors; houses, residential buildings; Business topics, general","year":"1964","rthl":"0","loc_desc":"from Mission, take Sharyland Rd north about .5 mi (loc. 2.5 mi N. of intersection of Sharyland & FM 495)","size":"18\"\" x 28\"\"","markertext":"Built 1917 by Father of the Texas citrus industry, pioneer developer of Rio Grande Valley, and the Intercoastal Canal. For 20 years chairman Sharyland School Board.      Here in 1953, Mrs. Shary, her daughter, Mrs. Allen Shivers, and Governor Shivers entertained President Dwight D. Eisenhower during Falcon Dam dedication.      Shivers, 1949-1957 Governor, was chief executive longer than any other; headed one of state's most progressive administrations, a major event of his regime was the restoration of the tidelands to Texas.  (1964)","atlas_number":"5215002787","latitude":26.261102934358217,"longitude":-98.27774731149076},
{"markernum":"4272","title":"Rio Theater","indexname":"Rio Theater","address":"516 Doherty","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567415","utm_north":"2899256","code":"buildings; opera houses and theatre","year":"1982","rthl":"1","loc_desc":"516 Doherty, Mission","size":"16\"\" x 12\"\"","markertext":"First known as Teatro La Paz (Peace Theatre), this cultural arts center was built about 1912 by Juan Bautista Barbera, a native of Spain who came to the United States in 1905.  A bricklayer by profession, Barbera brought films, lecturers, actors, and musicians to his theatre.  Enrique Flores bought the property and business in 1945 and changed its name to the Rio Theatre.  The vernacular commercial structure continues to be a center for cultural events in Mission.  Recorded Texas Historic Landmark - 1982.","atlas_number":"5215004272","latitude":26.2112668034969,"longitude":-98.32517112578894},
{"markernum":"4458","title":"Saint Joseph's Church","indexname":"Saint Joseph's Church","address":"","city":"Toluca Ranch","county":"Hidalgo","utm_zone":"14","utm_east":"605454","utm_north":"2883925","code":"eccesiastical buildings; Roman Catholic denomination; churches","year":"1965","rthl":"1","loc_desc":"at Toluca Ranch; from intersection of US 281 and FM 1015 go S on FM 1015 about 0.8 mi., then take Rancho Toluca Road E 0.27 mi. to palm tree lined lane, then go S 0.25 mi.","size":"14\"\" x 9\"\"","markertext":"Built for his rancho and villagers, as was custom of early dons, by Florencio Saenz.  Dedicated July 30, 1899, by Father L. Maurel, O.M.I., delegate of Rt. Rev. Peter Verdaguer, Vicar Apostolic, Brownsville.  Recorded Texas Historic Landmark, 1965.","atlas_number":"5215004458","latitude":26.070565568059813,"longitude":-97.94568446821039},
{"markernum":"4945","title":"Skaggs House","indexname":"Skaggs House","address":"1027 S. Texas Ave.","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"600896","utm_north":"2892285","code":"houses, residential buildings; design and construction; Spanish Colonial Revival (Architectural style)","year":"1993","rthl":"1","loc_desc":"1027 S. Texas Ave., Weslaco","size":"18\"\" x 28\"\"","markertext":"Prominent Weslaco bankers and citrus farmers C. Lester (1896-1966) and Florence Richardson Skaggs (1884-1983) bought 15 acres here in 1924. This Spanish colonial revival style residence, built in 1927, was designed for the Skaggses by prolific Weslaco architect R. Newell Waters.  It features an off-center entry and metal casement windows.  The house remained in the Skaggs family until 1992.  The house, native vegetation, and adjoining orchard provide a glimpse of Welaco's emerging prosperity in the late 1920s.  This site became the subject of conservation and preservation efforts in the early 1990s.  Recorded Texas Historic Landmark - 1993.","atlas_number":"5215004945","latitude":26.14636794385061,"longitude":-97.99060100114248},
{"markernum":"5125","title":"Stockholm","indexname":"Stockholm","address":"","city":"Edinburg vicinity","county":"Hidalgo","utm_zone":"14","utm_east":"612031","utm_north":"2918891","code":"Swedish immigrants/immigration; settlements; cotton; ghost towns","year":"1985","rthl":"0","loc_desc":"from Edinburg, takes SH 107 east about 10 mi, then 60 north on FM 491 about 8 mi.","size":"18\"\" x 28\"\"","markertext":"Located on the Hidalgo-Willacy County Line, Stockholm was a Swedish community promoted by the Wallin, Johnson & Matson Land Co. of Minnesota.  The Swedes, who settled here between 1912 and 1914, were attracted by the area's abundance of inexpensive, fertile farmland.  They formed a farm club to share information and problems, and raised cotton, grain, and corn.  Some were dairy farmers.  Stockholm, also known as Turner Tract, had churches, a school, grocery store, and cotton gin.  Near this site is the Stockholm Cemetery, one of the few physical reminders of the ghost town.  (1985)","atlas_number":"5215005125","latitude":26.385737728434005,"longitude":-97.8769099187156},
{"markernum":"5285","title":"The American Rio Grande Land and Irrigation System","indexname":"American Rio Grande Land and Irrigation System, The","address":"","city":"","county":"Hidalgo","utm_zone":"14","utm_east":"608721","utm_north":"2892739","code":"agriculture, general; land surveys, land companies, promotional towns; water topics","year":"1979","rthl":"0","loc_desc":"301 Second St., Mercedes","size":"18\"\" x 28\"\"","markertext":"Land developer, B. F. Yoakum saw agriculture potential along the Rio Grande and found investors in 1905 for an irrigation project. They purchased 250,000 acres and the townsite of Mercedes for business headquarters. The pump station began operating in 1908. The system had grown by 1920 to three large canals, miles of branches, and five pumping plants.  In 1930 the Hidalgo and Cameron County Water Control and Improvement District took over the system which continues to serve the farming area of the Lower Rio Grande Valley.  (1979)","atlas_number":"5215005285","latitude":26.149896906601995,"longitude":-97.91228982266702},
{"markernum":"14021","title":"Mercedes Enterprise","indexname":"Mercedes Enterprise","address":"230 S Texas St","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608645","utm_north":"2892422","code":"newspapers","year":"2007","rthl":"0","loc_desc":"230 S. Texas St.","size":"18\"\" x 28\"\"","markertext":"<center>Mercedes Enterprise</center> <p>On October 8, 1908, Isadore Moritz published the first issue of the Mercedes <i>Enterprise</i>. He continued the operation until 1914; that same year, Ben E. Brooks and L.T. Hoyt began the Mercedes <i>Tribute</i>. Another paper, the <i>News-Item</i>, started in 1922 and merged with the <i>Tribute</i> seven years later to form the <i>News-Tribune</i>. Paul Netz bought the franchise in 1941 and restored the original name. The newspaper has chronicled major national and international events, as well as community stories. The <i>Enterprise</i> has documented local history through special anniversary editions and has offered printing services, including bilingual publications, to area school districts, businesses and agencies.</p> <p>(2007)</p> <p><center>Marker is property of the state of Texas</center></p>","atlas_number":"5507014021","latitude":26.147040756244795,"longitude":-97.91307657646739},
{"markernum":"194","title":"Archer Park","indexname":"Archer Park","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576574","utm_north":"2898486","code":"parks","year":"1981","rthl":"0","loc_desc":"Archer Park, Ash Street between Broadway and Main, McAllen.","size":"18\"\" x 28\"\"","markertext":"This one-block-square tract of land was deeded to the city of McAllen for use as a public park in 1917, six years after the town was incorporated.  The donor, Mayor Oliver Percy Archer (1869-1930), was a prominent local businessman and civic leader. The site was officially named for him in 1933 by the McAllen Board of City Commissioners.  From 1936 to 1949 the McAllen Public Library was housed in the basement area of the bandstand.  The site of many community activities and celebrations, Archer Park serves as a reminder of the early days of McAllen.  (1981)","atlas_number":"5215000194","latitude":26.20385520091645,"longitude":-98.2335405960016},
{"markernum":"376","title":"Bentsen-Rio Grande Valley State Park","indexname":"Bentsen-Rio Grande Valley State Park","address":"","city":"Mission vicinity","county":"Hidalgo","utm_zone":"14","utm_east":"561889","utm_north":"2896166","code":"botany; parks","year":"1986","rthl":"0","loc_desc":"from Mission, take FM 2062 - about 5.5 mi. SW","size":"27\"\" x 42\"\"","markertext":"Before colonization, this valley was a lush thicket of woodlands and brush, nourished with rich soil deposited by the Rio Grande. Throughout the lower valley landscape represented a broad variety of plants and animals. Types more common north of the river coexisted here with those more common to the south.        Land grants were made to the original Spanish settlers of the Rio Grande Valley in the 18th century.  The divisions were called porciones, each a narrow strip of land with access to the river. The grant here was part of porcion 50, awarded to Jose Antonio Zamora by the ancient jurisdiction of Reynosa (Mexico). At the beginning of the 20th century, developers and farmers began large-scale clearing of the land. By the 1930s, much of the Rio Grande Valley had been cleared for citrus groves.      In 1944, more than 586 acres of native landscape here were saved and donated to the Texas State Parks Board. Cedar elm, hackberry, and mesquite mix with ebony, Mexican ash, and anaqua trees.  Along with the brushlands, they provide habitat for countless mammals, reptiles, and resident and migrant birds. The park preserves a part of the valley's ancient environment for the education and enjoyment of its visitors.       The parkland was donated on January 28, 1944 to the State Parks Board by Lloyd M. and Edna Ruth (Dolly) Bentsen, and Elmer C. and Marie J. Bentsen.  Texas Sesquicentennial 1836 - 1986","atlas_number":"5215000376","latitude":26.1836158666658,"longitude":-98.38063168326944},
{"markernum":"1252","title":"Donna Central Elementary School","indexname":"Donna Central Elementary School","address":"Main St at Scoey Ave","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594640","utm_north":"2895377","code":"educational buildings; educational topics; design and construction; Tudor Revival (Architectural style)","year":"1990","rthl":"1","loc_desc":"Main Street at Scobey Avenue, Donna","size":"16\"\" x 12\"\"","markertext":"Built as the result of a special bond election in 1925, this is the oldest existing structure in the Donna Independent School District. Initially an elementary school, it served as a junior high facility from 1965 to 1983.  Designed by the architectural firm of Elwing & Mulhausen, it is a highly significant part of Donna's built environment.  The school building features a two-story central block with a Tudor-arched entry and two large square towers.  Recorded Texas Historic Landmark - 1990","atlas_number":"5215001252","latitude":26.17470875986509,"longitude":-98.05295574137544},
{"markernum":"2408","title":"Havana","indexname":"Havana","address":"","city":"LaJoya","county":"Hidalgo","utm_zone":"14","utm_east":"549245","utm_north":"2903202","code":"cities and towns; Spanish immigrants/immigration; settlements","year":"1988","rthl":"0","loc_desc":"from La Joya, take US 83 West about 1.8 Mi to Havana","size":"18\"\" x 28\"\"","markertext":"Located on land known as Porcion 46, ceded by the crown of Spain to Don Jose Matias Tijerina in 1767, the community of Havana was named for Havana, Cuba, where Tijerina had stopped on his journey from Europe.  Among the early settlers here were the families of Josefa de la Garza Salinas and Civil War Union soldier Patricio Perez.  A frame church was built in 1891 and named for St. Joseph.  Descendants of early settlers still live in the area.  Many Havana pioneers are buried here in the Havana Cemetery. (1988)","atlas_number":"5215002408","latitude":26.247634656846834,"longitude":-98.50689747536988},
{"markernum":"3746","title":"Old Hidalgo County Jail","indexname":"Hidalgo County Jail, Old","address":"121 E McIntyre","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583619","utm_north":"2909443","code":"buildings; jails and prisons; Spanish Colonial Revival (Architectural style)","year":"1966","rthl":"1","loc_desc":"Museum of South Texas History","size":"16\"\" x 12\"\"","markertext":"Erected 1909-1910.  One of first buildings in town after county seat moved here 1908 from Old Hidalgo.  Spanish architecture, with red tile roof, white walls.  A new jail was built in 1922; this became community center, and served as a meeting place for civic groups until 1931; then was city hall until 1966.  Now the Hidalgo County Museum, its tower houses a hanging trap actually used only once, in 1913.  Recorded Texas Historic Landmark - 1966","atlas_number":"5215003746","latitude":26.302388273108065,"longitude":-98.16232092601172},
{"markernum":"4541","title":"San Joaquin Mission","indexname":"San Joaquin Mission","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573928","utm_north":"2887564","code":"Spanish immigrants/immigration; missions; Roman Catholic denomination; Spanish Colonial Revival (Architectural style)","year":"1936","rthl":"0","loc_desc":"McAllen Park, El Texano Drive at First Street, Hidalgo","size":"1936 Centennial - Subject Marker (gray granite)","markertext":"Approximate site of Mission San Joaquin del Monte a Visita, established in 1749 as part of Jose de Escandon's project to settle the region and civilize and Christianize the Indians.  (1936)","atlas_number":"5215004541","latitude":26.105380117211084,"longitude":-98.26064549103522},
{"markernum":"5009","title":"Spiderweb Railroad","indexname":"Spiderweb Railroad","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"567185","utm_north":"2893687","code":"railroads; land surveys, land companies, promotional towns","year":"1982","rthl":"0","loc_desc":"from Mission, take Fm 1016 South about 3.5 mi.","size":"18\"\" x 28\"\"","markertext":"Begun in 1912 when dirt roads hampered area transportation, the San Benito & Rio Grande Valley Railroad was instrumental in the early development of the region's towns and commerce.  It grew from the Brownsville Street and Interurban Railroad Company, established by Sam A. Robertson (1867-1938), a local civil engineer and land promoter.  As the line grew and spurs were constructed to remote frame communities, it became known as the Spiderweb Railroad. With just over 100 miles of track, the company became part of the Missouri-Pacific system in 1924.  (1982)","atlas_number":"5215005009","latitude":26.160995068764215,"longitude":-98.32776193990256},
{"markernum":"13003","title":"City of Pharr","indexname":"Pharr, City of","address":"118 S Cage Blvd","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581457","utm_north":"2897375","code":"cities and towns","year":"2003","rthl":"0","loc_desc":"118 S Cage Blvd","size":"27\"\" x 42\"\"","markertext":"For many centuries, nomadic Coahuiltecans lived in the Lower Rio Grande area. In the 1500s, Spanish explorers came through the region, and the Spanish government began to colonize both sides of the river by the late 1700s. At the close of the U.S.-Mexico War in 1848, the Rio Grande was established as the official boundary.   In 1909, John C. Kelly, Henry N. Pharr, W.E. Cage and R.C. Briggs formed the Pharr Townsite Company, platting and registering the new town. Kelly donated lots in the original plat for early churches, including the Methodist, Baptist, Catholic, Episcopal and Presbyterian denominations. Pharr schools began in 1911, and the community later joined with San Juan and Alamo to create the Pharr-San Juan-Alamo School District.   The city founders were also involved with the Louisiana-Rio Grande Canal Co., organized in 1910 to furnish irrigation and domestic water to 40,000 acres in the Pharr area by means of a Rio Grande pumping plant. The water system led the economy to shift from ranching to crop production, and the railroad, which came through the area in 1905, made it possible to ship produce around the country.   The city of Pharr was incorporated in 1916. Given its location at the intersection of two major developing highways and the growth of commercial transportation, Pharr became known as the \"\"Hub City of the Valley.\"\" Agricultural shipping and packing businesses were mainstays in the city economy.   With the continued growth of the Lower Rio Grande Valley, Pharr remains a vital business center, and an international bridge now provides an important commercial link to Mexico. (2004)","atlas_number":"5215013003","latitude":26.193555581864487,"longitude":-98.18473841488387},
{"markernum":"16768","title":"Cpl. Harlon Block, USMC","indexname":"Block, Harlon, USMC Cpl.","address":"1020 West 18th Street","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"599725","utm_north":"2892011","code":"Military, wars","year":"2011","rthl":"0","loc_desc":"Harlon Block Sports Complex","size":"18\"\" x 28\"\"","markertext":"During World War II, U.S. forces captured the small yet strategic Japanese-held Pacific Island of Iwo Jima. On Feb. 23, 1945, during combat, marine Harlon Block aided in laying telephone wire up an inert volcano. At the summit, Block and five others improvised a flagpole, attaching a flag visible to those on the island and outlying ships. In doing so, Block and his fellow servicemen became the subject of one of the most recognized photographic images of World War II, the U.S. flag raising on Mt. Suribachi. On Mar. 1, 1945, his squad leader was killed. Block took command, but was tragically killed hours later. His remains were repatriated in 1949 to his hometown of Weslaco and in 1995 to the IwoJjima monument in Harlingen.","atlas_number":"5507016768","latitude":26.143975795982914,"longitude":-98.00233570090982},
{"markernum":"323","title":"Battle of La Bolsa","indexname":"La Bolsa, Battle of","address":"","city":"Progresso","county":"Hidalgo","utm_zone":"14","utm_east":"613163","utm_north":"2885405","code":"outlaws; rangers; military topics","year":"1991","rthl":"0","loc_desc":"from Progresso, take US 281 east about 4 mi.","size":"18\"\" x 28\"\"","markertext":"In 1859 and early 1860 a series of raids on Texas settlements led by Juan N. Cortina (1824-1894) led to skirmishes with companies of Texas Rangers and U.S. soldiers.  These conflicts became known as the Cortina War.  On February 4, 1860, a battle occurred at La Bolsa Bend (ca. 1 mi. S.) between Cortina's raiders and Captain John S. \"\"Rip\"\" Ford's Texas Rangers.  The Rangers successfully defended the riverboat \"\"Ranchero\"\", traveling downstream from Rio Grande City, from an attack by Cortina's band.  Cortina escaped into Mexico and later became a general in the Mexican Army.","atlas_number":"5215000323","latitude":26.083343534149932,"longitude":-97.86849401925357},
{"markernum":"1441","title":"El Sal del Rey","indexname":"El Sal del Rey","address":"","city":"Linn","county":"Hidalgo","utm_zone":"14","utm_east":"592088","utm_north":"2933637","code":"geology","year":"1964","rthl":"0","loc_desc":"from Linn, take FM 186 SE about 4 miles","size":"14\"\" x 24\"\"","markertext":"(The salt of the King)      Directly to the north. Upon Spanish discovery, 1746, claimed for King, under old law that salt was money.        People of wide area got salt here. 1863-64 works aided Texas in the Civil War. Later disputes over El Sal del Rey established Texas laws for private ownership of minerals. (1964)","atlas_number":"5215001441","latitude":26.52029528101672,"longitude":-98.07574947116628},
{"markernum":"1442","title":"El Sal del Rey, C.S.A.","indexname":"El Sal del Rey, C. S. A.","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583614","utm_north":"2909258","code":"geology; Civil War; military topics","year":"1963","rthl":"0","loc_desc":"Courthouse square, US Hwy. 281 bus., Edinburg","size":"Civil War Memorials - (pink granite)","markertext":"Front side:      Large salt lake located 26 miles northeast was principal source of salt in South Texas during the Civil War.  Put under state guard and agent 1862.  Salt sold to families, Texas Military Board, Army of Confederacy and wagons returning north on cotton road-vital trade route for South thru Mexico.  Due to military and domestic importance, Union forces periodically wrecked the salt works from November 1863 until war's end.  It was also a Texas Confederate base for the 1864 recapture of Brownsville.   A memorial to Texas who served the Confederacy; erected by the State of Texas 1963.  Back side:      Salting or smoking were only was to preserve meat at time of Civil War.  When South levied a meat tithe, salt necessary to cure bacon and beef for military.  Salt was a must for horses and mules used by cavalry, artillery and supply wagons.  Hides were preserved with it to make leather for shoes and harness.  Other wartime salt works were operated along coast and in 7 counties in central, east and west Texas.  El Sal del Rey, Spanish for \"\"Salt for the King\"\" also played a significant role in the history of Texas mineral law.  A legal controversy raged for years over its ownership.  Under Spain, mineral rights belonged to crown.  Mexico retained the principle of the state ownership of minerals.  Texas, as Republic and State, kept minerals in the public domain.  Private possession of the lake began with the 1866 Texas Constitutional Convention which relinquished all minerals to landowners.  The principle of private ownership was readopted in the Constitutions of 1869 and 1876.","atlas_number":"5215001442","latitude":26.300718290533805,"longitude":-98.16238301567323},
{"markernum":"4987","title":"Southern Pacific Depot","indexname":"Southern Pacific Depot","address":"602 University","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583032","utm_north":"2909322","code":"Colonial Revival; railroad depots; railroads; design and construction","year":"1986","rthl":"1","loc_desc":"602 University, Edinburg","size":"18\"\" x 28\"\"","markertext":"Completed and occupied on August 1, 1927, this depot was designed by Southern Pacific Railroad architect Leonard B. McCoy, and built by Ward Construction of El Paso.  The depot was part of a major railroad expansion into South Texas.  Edinburg felt a positive economic impact when the railroad began shipping citrus and vegetables and serving passengers' needs.  Passenger service ceased in 1952, although freight service continued until 1982.  The train depot is a fine example of Spanish colonial revival architecture.  Features include double entries, tile detailing and built in benches.  Recorded Texas Historic Landmark - 1996","atlas_number":"5215004987","latitude":26.30133003698227,"longitude":-98.16820867876547},
{"markernum":"15868","title":"P.P. Ackley and the Texas Chisholm Trail","indexname":"P.P. Ackley and the Texas Chisholm Trail","address":"Hooks Avenue (US Business 83) and South 8th Street","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594424","utm_north":"2894907","code":"","year":"2009","rthl":"0","loc_desc":"Donna City Square Park","size":"18\"\" x 28\"\"","markertext":"Illinois native Peter Preston Ackley (1858-1940) moved to Texas as a boy. He went on several trail drives in 1870s and 1880s, bringing from cattle Texas, Nebraska and Canada to Kansas railheads. Starting in the 1920s, Ackley worked to have the Chisholm Trail recognized as a National Highway. In the 1930s he formed the Texas Longhorn Chisholm Trail Association and placed dozens of metal and granite markers along historic cattle trails in several states, Canada and Mexico. Ackley wintered in Donna and placed a trail marker here; a sign outside his house read \"\"End of the Chisholm Trail.\"\" His efforts helped to document the era of the cattle drives in the American West.","atlas_number":"5507015868","latitude":26.17047961013355,"longitude":-98.05515118556096},
{"markernum":"16277","title":"First Presbyterian Church","indexname":"First Presbyterian Church","address":"709 South Iowa Avenue","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"601181","utm_north":"2893088","code":"Church","year":"2010","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"In 1920, area Presbyterians built a manse under the supervision of the Rev. Horace N. Cunningham; services were held in the building. In January 1921, seven charter members organized First Presbyterian Church. They completed a church building in 1923; it was replaced in 1951 by a larger church, designed by noted area architect and church member, William C. Baxter. Members have long worked with the needy, including outreach activities for low-income residents on the U. S. - Mexico border. The congregation also supported organization of the Spanish-speaking San Pablo Presbyterian Church. Today, First Presbyterian Church of Weslaco continues to serve as a spiritual leader in the community.   (2010)","atlas_number":"5507016277","latitude":26.153597629020588,"longitude":-97.98768756248118},
{"markernum":"3747","title":"Old Hidalgo School","indexname":"Hidalgo School, Old","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"574079","utm_north":"2886724","code":"educational buildings; educational topics","year":"1986","rthl":"0","loc_desc":"Sixth & Flora Streets, Hidalgo","size":"18\"\" x 28\"\"","markertext":"Thought to have been built about 1898, this two-story brick structure has served as an educational facility for generations.  The first recorded graduation took place in 1922, with a class of three.  The school housed students in elementary grades until 1960.  Various rooms of the old building were used for offices until 1980, and in 1984 renovation began to convert it into central administrative offices.  The old school has also served the community as a place of refuge from hurricanes and floods and as the site of many social activities.","atlas_number":"5215003747","latitude":26.097788027819945,"longitude":-98.25918322811765},
{"markernum":"2470","title":"Hidalgo County's First Oil Well","indexname":"Hidalgo County's First Oil Well","address":"","city":"La Joya vicinity","county":"Hidalgo","utm_zone":"14","utm_east":"548368","utm_north":"2903661","code":"oil/petroleum topics","year":"1968","rthl":"0","loc_desc":"from La Joya take US 83 about 1.7 mi west, marker is on north side of highway","size":"14\"\" x 24\"\"","markertext":"<center>Hidalgo County's</center> <center>First Oil Well</center> <p>John M. Lawrence No. 1 oil well was brought in September 18, 1934, near this site by veteran driller Otto C. Woods.  Well flowed 1,000 or more barrels a day.  At first the oil formed a lake beside the well.</p> <p>County has produced 20 million barrels of oil.</p> <p>(1968)</p>","atlas_number":"5215002470","latitude":26.251808942386738,"longitude":-98.51566165927414},
{"markernum":"3002","title":"La Noria Cardenena","indexname":"La Noria Cardenena","address":"","city":"Linn","county":"Hidalgo","utm_zone":"14","utm_east":"586913","utm_north":"2934099","code":"graveyards; ranches/ranching; Mexican immigrants/immigration; Spanish immigrants/immigration; land surveys, land companies, promotional towns; Roman Catholic denomination; churches","year":"1988","rthl":"0","loc_desc":"from Linn, take US 281 south about .5 miles","size":"27\"\" x 42\"\"","markertext":"Parts of present Hidalgo, Cameron, Willacy, and Kenedy counties were once included in two Spanish land grants, San Juan de Carricitos and San Salvador del Tule.  The original grantee of the Carricitos grant was Jose Narciso Cavazos.  After his death, ownership of the land passed to his heirs.        The Tule lands were granted to Juan Jose Balli in 1798.  Balli obtained a business loan from Antonio Cardenas of Reynosa, Mexico.  Following Balli's death and subsequent litigation over the loan, the lands reverted to Cardenas heirs in 1828.        The Cardenas family established La Noria Cardenena Ranch in 1829, so named because of the fresh water wells (norias) found in the region.  Gradually, the Cardenas and Cavazos families were joined by a number of marriages, which also combined property interests.  Although the families endured many hardships, including years of indian and bandit attacks, they continued to run a strong ranching operation.        Still in existence on part of the ranch is a small cemetery, begun in 1835 and named Nino Jesus de Praga in 1863.  Also surviving are the mid-19th century main ranch house and a church built next to the cemetery in 1944.  (1988)","atlas_number":"5215003002","latitude":26.52479338064334,"longitude":-98.12765238222501},
{"markernum":"3910","title":"Padre Miguel Hidalgo y Costilla","indexname":"Costilla, Padre Miguel Hidalgo y","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583637","utm_north":"2909255","code":"Mexican immigrants/immigration; religious leaders; Presbyterian denomination; Roman Catholic denomination; military topics","year":"1983","rthl":"0","loc_desc":"Hidalgo Plaza, 100 N. Closner St., Edingburg","size":"27\"\" x 42\"\"","markertext":"Miguel Hidalgo y Costilla (1753-1811), for whom the county of Hidalgo is named, was born near Guanajuato, Mexico, while the country was still under Spanish rule.  After being ordained a priest in 1779, he served churches in Colima, San Felipe, and Dolores, where he emerged as a champion of human rights who feared the colonial system would never allow independence and justice for all citizens.  A firm believer in economic independence from the mother country, Hidalgo worked toward that goal by teaching farming methods and industrial techniques to Indians and others in his parish.      In 1810 Padre Hidalgo, along with military leader Ignacio de Allende, conspired to overthrow the Royalist government. Warned that officials suspected their plot, Hidlago gathered sympathizers in Dolores.  Following early mass on the morning of September 16, 1810, Hidalgo made his famous \"\"Grito De Delores,\"\" a call to arms which in effect began the revolt that led to Mexican independence from Spain in 1821.  During a battle on the bridge of Calderon, Padre Hidalgo was captured and later was unfrocked and shot.      Considered \"\"The Father of Mexican Independence,\"\" Padre Hidalgo continues to be honored for his leadership throughout Mexico and the Southwest.  (1983)","atlas_number":"5215003910","latitude":26.300689859618434,"longitude":-98.16215282382919},
{"markernum":"4259","title":"Richard Alvis Marsh","indexname":"Marsh, Richard Alvis","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"585662","utm_north":"2909701","code":"local law enforcement officer; educational topics","year":"1993","rthl":"0","loc_desc":"Brush Wood Cemetery, on Schunior Street (FM 2128) .3 miles east of US 281, Edinburg","size":"18\"\" x 28\"\"","markertext":"Kentucky native Richard A. Marsh had a notable military and journalism career before distinguishing himself as an educator in the Rio Grande Valley.  He arrived in San Antonio in 1874 then left for Fort Ringgold (Rio Grande City) in 1880 to teach the fort's children.  Disheartened by the particularly substandard educational facilities available to children of Mexican descent, Marsh devoted the rest of his life, first as a traveling teacher for area ranch schools and later as Hidalgo County Superintendent of Schools (1902-1914), to significantly upgrade the area's public school system.  (1993)","atlas_number":"5215004259","latitude":26.304596653619704,"longitude":-98.14183920649745},
{"markernum":"5504","title":"Tom Mayfield","indexname":"Mayfield, Tom","address":"","city":"San Juan","county":"Hidalgo","utm_zone":"14","utm_east":"584231","utm_north":"2896972","code":"World War I; law enforcement; rangers; local law enforcement officer","year":"1993","rthl":"0","loc_desc":"125 West 5th Street (Business 83), San Juan","size":"18\"\" x 28\"\"","markertext":"Tom Mayfield left the Gonzales County farm of his parents, John and Maggie Mayfield, in 1898 to help buy horses for Teddy Roosevelt's Rough Riders.  Between 1910-1921 Tom served as Pharr City Marshal, Texas Ranger, and Hidalgo County deputy sheriff.  His role in exposing a German-Mexican WW I plot in nearby San Diego and his amazing escape from a Mexican firing squad in 1921 made Tom a local celebrity.  As Pharr-San Juan-Alamo's deputy constable (1938-1963) Tom gained the community's highest respect.  He spent his last years as a resident of the San Juan Hotel.  (1993)","atlas_number":"5215005504","latitude":26.18975704634817,"longitude":-98.15700341862052},
{"markernum":"5754","title":"Weslaco","indexname":"Weslaco","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"601005","utm_north":"2893511","code":"cities and towns; land surveys, land companies, promotional towns","year":"1985","rthl":"0","loc_desc":"Weslaco City Hall, 500 S. Kansas Ave., Weslaco","size":"18\"\" x 28\"\"","markertext":"Located on part of a Spanish land grant known as Llano Grande, Weslaco was founded in 1919 by a partnership composed of R. C., Dan, and Ed Couch and Robert L. Reeves. The city's name is take from the initials of the W. E. Stewart Land Co., which held title to the site from 1917 to 1919.  Weslaco had a post office by 1920 and was incorporated in 1921. Founded nearly ten years after most other valley cities in the area, Weslaco depends on a wide variety of businesses for its economic base.  Descendants of some of the early settlers still live here.  (1985)","atlas_number":"5215005754","latitude":26.157428946252793,"longitude":-97.98941531341644},
{"markernum":"660","title":"Camp Ebenezer","indexname":"Camp Ebenezer","address":"","city":"Alamo","county":"Hidalgo","utm_zone":"14","utm_east":"586644","utm_north":"2896561","code":"agriculture, general; railroads; land surveys, land companies, promotional towns","year":"1986","rthl":"0","loc_desc":"1341 W. Business Route US 83, Alamo","size":"18\"\" x 28\"\"","markertext":"From 1902 to 1909 Peter Ebenezer Blalock and George L. Hawkins bought 32,000 acres of land here.  By 1908 they had built shipping pens at this site and named the railroad depot Ebenezer.  Their ranching plans ended in 1909 when the tract was sold to the Alamo Land and Sugar Company.  Under the direction of C. H. Swallow (1868-1957), the company colonized the land after 1914.  Excursion trains brought prospective farmers, housed here at \"\"Camp Ebenezer.\"\"  The depot was moved one mile east in 1919 to serve the new town of Alamo.  The camp served until the 1930s as temporary housing for land buyers.","atlas_number":"5215000660","latitude":26.185902791742905,"longitude":-98.13288340218602},
{"markernum":"692","title":"Campsite of the \"\"Fighting 69th\"\"","indexname":"Fighting 69th, Campsite of","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576009","utm_north":"2898400","code":"World War I; outlaws; military topics","year":"1970","rthl":"0","loc_desc":"100 S. Bicentennial (in Park), McAllen","size":"20\"\" x 20\"\"","markertext":"Famed New York Infantry Regiment.  Encamped in McAllen during 1916-1917 bandit trouble, guarding the border and preventing the smuggling of arms across Rio Grande to Pancho Villa.  Tour of duty here seasoned the men for rigors of World War I, wherein regiment won undying glory in France.","atlas_number":"5215000692","latitude":26.203108747104068,"longitude":-98.23920055106282},
{"markernum":"1420","title":"El Granjeno Cemetery","indexname":"El Granjeno Cemetery","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"569425","utm_north":"2890924","code":"graveyards; Mexican immigrants/immigration","year":"1985","rthl":"0","loc_desc":"from Mission, take FM 1016 south about 3.2 mi to FM 494 south. Take FM 494 south about 2.2 mi.","size":"18\"\" x 28\"\"","markertext":"El Granjeno Cemetery was established in 1872 with the burial of Don Antonio Garza.  His brother, Don Juan Garza Escheverria, donated the surrounding land for use by the communities of El Granjeno and nearby Madero.  A native of Reynosa, Mexico, Don Juan (B. 1854) is buried here, along with many of his descendants.  Also interred here are veterans of the Civil War, World War I and the Vietnam War.  El Granjeno Cemetery has served families on both sides of the Rio Grande and is a reflection of the history of the area's small working villages. (1985)","atlas_number":"5215001420","latitude":26.135941546338085,"longitude":-98.30549797586296},
{"markernum":"2998","title":"La Lomita Farms","indexname":"La Lomita Farm","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567461","utm_north":"2892940","code":"agriculture, general; French immigrants/immigration; religious leaders; missions; Roman Catholic denomination","year":"1981","rthl":"0","loc_desc":"from Mission take FM 1016 about 5 miles south","size":"27\"\" x 42\"\"","markertext":"In 1849 Catholic priests of the missionary Oblates of Mary Immaculate began mission work in Texas under the direction of Bishop Jean Marie Odin.  From Brownsville, they traveled throughout the lower Rio Grande Valley, ministering to the residents of the area.  Through their work in Northern Mexico, they met a Frenchman named Rene Guyard.  A Reynosa merchant and a Texas landowner, Guyard made this part of his Rancho La Lomita available for the establishment of a mission to serve his ranch workers.  The first chapel was constructed here in 1865.  The Oblates inherited La Lomita and the nearby Nogalito Ranch following Guyard's death in 1871.  A third connecting tract was purchased later with the help of an overseer, the priests hoped to produce food for their needs and to provide a profit to fund further missionary work in the area.  Although the mission was successful, the farming operation proved to be a financial burden on the Oblates.  In 1909 they sold all but 400 acres to John J. Conway.  A town he founded (5 miles north) was later named Mission in honor of the pioneer La Lomita Chapel, the center of early area Catholic missionary work.  This site was abandoned in 1911, but later restored.  (1981)","atlas_number":"5215002998","latitude":26.1542374620571,"longitude":-98.32503931416721},
{"markernum":"3342","title":"Mercedes City Hall","indexname":"Mercedes City Hall","address":"323 South Ohio Street, Mercedes","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608740","utm_north":"2892505","code":"buildings; design and construction; institutional buildings; Gothic Revial (Architectural style)","year":"1994","rthl":"1","loc_desc":"323 South Ohio Street, Mercedes","size":"16\"\" x 12\"\"","markertext":"Constructed in 1928 to house the town's municipal offices and fire station, this building was designed by architect R. Newell waters of Weslaco.  The two story Gothic style building, constructed of red brick, features a copper cupola designed to house the fire alarm, cast stone detailing, and a gabled roof.  The second floor served as a town meeting room and firemen's dormitory.  This building served as the Mercedes City Hall for nearly fifty years.  Recorded Texas Historic Landmark - 1995.","atlas_number":"5215003342","latitude":26.147782909800156,"longitude":-97.91211935162364},
{"markernum":"4254","title":"The Rev. Pierre Yves Keralum","indexname":"Keralum, The Rev. Pierre Yves","address":"417 S International Blvd","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"604140","utm_north":"2893780","code":"French immigrants/immigration; religious leaders; Presbyterian denomination; design and construction; Roman Catholic denomination","year":"1989","rthl":"0","loc_desc":"intersection Mile 3W and Expressway 83","size":"18\"\" x 28\"\"","markertext":"<center>The Rev. Pierre Yves Keralum</center> <p><center>\"\"The Lost Missionary\"\"</center></p> <p><center>(1817-1872)</center></p>  <p>Architect Pierre Yves Keralum was ordained an Oblate priest at Marseilles, France, in 1852. That same year, he came to south Texas as a member of the Missionary Oblates of Mary Immaculate (O.M.I.). Evidence of his architectural skill can be seen at Our Lady of Refuge Church in Roma and the Cathedral in Brownsville. As a missionary, Keralum covered a large area of South Texas, ministering to thousands of people. He disappeared while traveling in this area in 1872. His remains were not discovered until ten years later.</p> <p> (1989)</p> <p>Marker is property of the state of Texas</p>","atlas_number":"5215004254","latitude":26.15963400958383,"longitude":-97.95803122285946},
{"markernum":"4570","title":"Santa Ana Land Grant","indexname":"Santa Ana Land Grant","address":"","city":"Alamo","county":"Hidalgo","utm_zone":"14","utm_east":"586514","utm_north":"2885219","code":"graveyards; wildlife management; Mexican immigrants/immigration; land surveys, land companies, promotional towns","year":"1993","rthl":"0","loc_desc":"Santa Ana National Wildlife Refuge Visitor Center off US 281, Alamo","size":"18\"\" x 28\"\"","markertext":"The 15-square-mile Santa Ana land grant was awarded by Mexico to Benigno Leal in 1834.  Leal established his Rancho de Adentro (inside ranch) headquarters and cemetery at this site.  Leal's original grant was eventually combined with adjacent lands to form the \"\"Alamo Tract\"\" which between 1910 and 1930 was converted to farmland by the Louisiana and Rio Grande Canal Company.  The tract's southern section nevertheless retained its natural riverine forest environment and was acquired by the U.S. government in 1943 to create the Santa Ana National Wildlife Refuge.  (1993)","atlas_number":"5215004570","latitude":26.083507588468798,"longitude":-98.13493917483021},
{"markernum":"4661","title":"Shary Building","indexname":"Shary Building","address":"900 Doherty St.","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567465","utm_north":"2899723","code":"buildings; houses, residential buildings; land surveys, land companies, promotional towns; Spanish Colonial Revival (Architectural style)","year":"1997","rthl":"1","loc_desc":"","size":"27\"\" x 42\"\"","markertext":"Designed by San Antonio architect Harvey P. Smith, this two-story edifice was constructed of brick with white stone trimming and erected on the site of Mission founder John Conway's business offices. Intended to house the multifirm organization of John H. Shary, known as \"\"The Father of the Texas Citrus Industry,\"\" the structure was completed in 150 days by June 1939 and originally cost $40,000.    A distinctive Spanish colonial revival design, the building contains many features of the Mexican colonial style, such as its exposed tile roof with clipped eaves, similar to thatched roofs of Mexican domestic architecture. The concrete tiers of its first-story windows evoke the wrought iron brackets of Mexican balconies of the 19th century. Wrapped in native brick painted white, the building would insulate itself in Mission's humid climate until the late 1940s, when central air became practical. The 1979 addition of a \"\"City Hall Room\"\" was a one-story wing set back from the main elevation to blend with the original \"\"L\"\" shape.    Dedicated to the community in 1939, the building became the offices of the city of Mission upon its sale by Shary's daughter and her husband, former Texas Governor Allan Shivers, in 1960.     Recorded Texas Historic Landmark - 1997","atlas_number":"5215004661","latitude":26.21548098006998,"longitude":-98.32464631115683},
{"markernum":"5530","title":"Town of Hidalgo","indexname":"Hidalgo","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573928","utm_north":"2887564","code":"cities and towns; settlements","year":"1936","rthl":"0","loc_desc":"McAllen Park, El Texano Drive & First, Hidalgo","size":"1936 Centennial - Highway Marker (pink granite)","markertext":"County seat of Hidalgo County 1854-1908.  Known as Edinburgh in 1852.  Name changed in 1861 to Hidalgo in honor of Miguel Hidalgo y Costilla, 1753-1811, parish priest who led the movement in 1810 for Mexican independence.  Almost completely washed away by an overflow of the Rio Grande in September, 1887.","atlas_number":"5215005530","latitude":26.105380117211084,"longitude":-98.26064549103522},
{"markernum":"13091","title":"Cortez Hotel","indexname":"Cortez Hotel","address":"260 S Texas Ave","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"600830","utm_north":"2893716","code":"Spanish Colonial Revival (Architectural style); inns, hotels, motels; Mediterranean (architectural style)","year":"2004","rthl":"1","loc_desc":"260 S Texas Ave","size":"18\"\" x 28\"\"","markertext":"Three years after Edwin C. Couch and Robert Reeves founded the city of Weslaco in 1919, Couch deeded this block as a city park. In 1928, city officials hired architect Paul G. Silber and his San Antonio Argentum Development Corporation to build a hotel here. The four-story Spanish Colonial Revival structure became a social center when it opened December 31, 1928. Groups such as the city's Camarillo Dance Club and local service clubs met in the hotel ballroom, which also served as the site of graduations and political rallies. The business changed hands throughout the 20th century, and today the hotel remains a symbol of an era in Valley history marked by civic pride and community progress. (2005)","atlas_number":"5215013091","latitude":26.159292014477618,"longitude":-97.99115010158864},
{"markernum":"15865","title":"Leo Najo","indexname":"Leo Najo","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566807","utm_north":"2900166","code":"Mexican American topics; sports","year":"2009","rthl":"0","loc_desc":"Leo \"\"Najo\"\" Alaniz Baseball Park, West 13th Street, 400 feet west of North Slabaugh Avenue","size":"27\"\" x 42\"\"","markertext":"<center>LEO NAJO</center> <center>(February 17, 1899 - April 25, 1978)</center> <p>Leonardo Alaniz, better known as Leo Najo, was one of the first Mexican-Americans to play professional baseball in the United States. Born in the Mexican community of La Lajilla, Nuevo Leon, he moved to Mission with his mother, Rosario Alanis, in 1909. As a youth, he became interested in baseball and in 1918, he helped form a team called the Mission 30-30 Rifles (later Mission 30-30s).</p> <p>During the early 1920s, Najo, whose nickname came from an alteration of <i>conejo</i> (rabbit), played for teams in Mexico and Laredo. He was known for his high batting average and baserunning speed. In 1924, Najo joined the San Antonio Bears minor league team and played for several others before the Chicago White Sox major league franchise acquired him in 1925. He did not make the lineup and was sent back to the minor leagues. Najo continued to play impressively but suffered a serious leg injury in a collision during a game, ending his major league possibilities.</p> <p>Najo continued to play in the minors until 1933, when he returned to Mission. He helped operate his family's tavern on West 6th Street and invested in real estate. Najo managed the Mission 30-30s from 1933 to 1937, and played and managed in Mexico for two more seasons. By the early 1940s, he married Elida Garza; the two reared eleven children. Najo continued to teach and manage baseball. In 1973, \"\"Leo Najo Day\"\" was proclaimed, the street in Mission where he lived (7th Street) was renamed Leo Najo Street, and the high school baseball field was renamed in his honor. In 1973, he was the first player formally inducted into the Mexican Baseball Hall of Fame. Today, Leo Najo is remembered as a positive role model whose skills on the diamond were only surpassed by his character and class.</p> <p align=right>(2009)</p align=right>","atlas_number":"5507015865","latitude":26.21951159949214,"longitude":-98.3312099458984},
{"markernum":"831","title":"Chimney Park, Site of Mission Canal Company Pumping Plant","indexname":"Chimney Park, Site of Mission Canal Company Pumping Plant","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566619","utm_north":"2894108","code":"agriculture, general; land surveys, land companies, promotional towns; water topics","year":"1985","rthl":"0","loc_desc":"from Mission take FM 1016 2 miles south to RV Park, marker is mounted on chimney","size":"18\"\" x 28\"\"","markertext":"In 1907, John J. Conway and James W. Hoit began the Mission Canal Co. irrigation system, which was instrumental in the early agricultural growth of the area.  Here they built the first pump station out of hand made brick from Madero.  The 106-ft. chimney carried smoke from wood-fired boilers which produced steam to drive the pump.  The plant was later operated by John H. Shary and by Hidalgo County Water Control and Improvement Districts No. 7 and No. 14.  The property was developed for recreational use after a new pumping plant was built upstream in the late 1950s.","atlas_number":"5215000831","latitude":26.16482262171256,"longitude":-98.33340329251689},
{"markernum":"1810","title":"First Pharr-San Juan-Alamo School","indexname":"Pharr-San Juan-Alamo School, First","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"582392","utm_north":"2897411","code":"educational topics","year":"1986","rthl":"0","loc_desc":"old US 83 at Fir Street, Pharr","size":"18\"\" x 28\"\"","markertext":"The common school district of Pharr and San Juan began construction of this school in 1915.  First used for the 1916-1917 school year, its enrollment was 143, with twelve teachers and a graduating class of nine.  The name was changed in 1919 to Pharr-San Juan Independent School District.  Although the town of Alamo was also founded that year and contributed students to the school, the Alamo name was not officially added until 1959.  In 1961 this became Jefferson Junior High.  It was named Memorial Junior High in 1979 in honor of all Pharr-San Juan-Alamo veterans.  Texas Sesquicentennial 1836-1986.","atlas_number":"5215001810","latitude":26.19382728540638,"longitude":-98.17537895806271},
{"markernum":"5755","title":"Weslaco City Hall","indexname":"Weslaco City Hall","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"601005","utm_north":"2893511","code":"buildings; design and construction; Spanish Colonial Revival (Architectural style)","year":"1978","rthl":"1","loc_desc":"Weslaco City Hall, 500 S. Kansas Ave., Weslaco","size":"16\"\" x 12\"\"","markertext":"Erected in 1928, this structure replaced a frame community building at this site.  City founder Ed Couch (1879-1944) and Mayor David E. Kirgan (1877-1936) led ceremonies marking the building's completion.  Prominent Weslaco architect R. Newell Waters designed the City Hall with Spanish colonial style detailing.  Intricate cast stone sculpture adorns the entryway and cupola.  Spanish tiles with colorful geometric patterns decorate the interior stairway.  Recorded Texas Historic Landmark - 1978.","atlas_number":"5215005755","latitude":26.157428946252793,"longitude":-97.98941531341644},
{"markernum":"3744","title":"Old Hidalgo County Jail","indexname":"Hidalgo County Jail, Old","address":"First and Flora","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573756","utm_north":"2886951","code":"buildings; jails and prisons","year":"1984","rthl":"1","loc_desc":"First and Flora","size":"16\"\" x 12\"\"","markertext":"Built in 1886 by S. W. Brooks, who also constructed the nearby courthouse, this jail served Hidalgo County during a turbulent period in its history, when outlaw raids were still occurring.  The city's first newspaper, \"\"The Hidalgo Advance,\"\" was published here from 1904 to 1908.  The two-story jail, which features handmade brick and a corbeled cornice along the roofline, served the county until 1908, when the seat of government was moved to Chapin (now Edinburg).  Recorded Texas Historic Landmark - 1984","atlas_number":"5215003744","latitude":26.099854160142982,"longitude":-98.26240027451507},
{"markernum":"3745","title":"Old Hidalgo County Courthouse","indexname":"Hidalgo County Courthouse, Old","address":"First and Flora","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573756","utm_north":"2886951","code":"buildings; courthouses","year":"1964","rthl":"1","loc_desc":"First and Flora, Hidalgo","size":"16\"\" x 12\"\"","markertext":"This building served as the Hidalgo County Courthouse from its construction in 1886 until the County Seat was moved to Chapin (later name Edinburg) in 1908.  Made of brick from nearby Reynosa, Mexico, it originally was a two-story structure.  Its cupola, roof, and second floor were destroyed in an early 20th-century fire.  An important building during the county's formative years, the old Courthouse later served as an immigration and customs facility.  Recorded Texas Historic Landmark - 1963","atlas_number":"5215003745","latitude":26.099854160142982,"longitude":-98.26240027451507},
{"markernum":"150","title":"American Legion Hall","indexname":"American Legion Hall","address":"316 S. Main","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594470","utm_north":"2894528","code":"buildings; fraternal organizations; military topics","year":"1964","rthl":"1","loc_desc":"316 S. Main","size":"12\"\" x 6\"\"","markertext":"Donna Border Post No. 107.  Dedicated 1920.  First American Legion Hall built or owned by any post in the world.  Recorded Texas Historic Landmark - 1964","atlas_number":"5215000150","latitude":26.167054819111513,"longitude":-98.05471853243401},
{"markernum":"1245","title":"Don Florencio Saenz Homestead","indexname":"Saenz, Don Florencio, Homestead","address":"Rancho Toluca Road","city":"Toluca Ranch","county":"Hidalgo","utm_zone":"14","utm_east":"605475","utm_north":"2883953","code":"ranches/ranching; Spanish immigrants/immigration","year":"1965","rthl":"1","loc_desc":"at Toluca Ranch: from intersection of US 281 and FM 1015, go S on FM 1015 about 0.8 mi., then take Rancho Toluca Road E 0.27 mi. to palm tree lined lane, then go S 0.25 mi.","size":"16\"\" x 12\"\"","markertext":"Built on family Spanish land grant in 1902.  Headquarters for Toluca Ranch, which at one time stretched 17 miles north from the Rio Grande.  Here Saenz operated a mercantile store, promoting cattle ranching and river farming as successful business ventures for the valley.        Site of 1915 bandit raid in which a private was killed when U.S. soldiers discovered and fought off desperadoes trying to burn the house.  Recorded Texas Historic Landmark, 1965.","atlas_number":"5215001245","latitude":26.070816825123757,"longitude":-97.94547227701455},
{"markernum":"1514","title":"Everitt Building","indexname":"Everitt Building","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583730","utm_north":"2909446","code":"commercial buildings; markets, merchantiles","year":"1983","rthl":"0","loc_desc":"N. 12th & McIntyre Streets, Edinburg","size":"18\"\" x 28\"\"","markertext":"One of the earliest commercial ventures in Edinburg, this building was completed in 1910 by John Closner (1853-1932), a founder of the townsite.  Its first tenant was the Rev. W. O. Miller, who operated a hardware and machinery store. During World War I, it was used as a Red Cross workshop.  In 1920 the property was acquired by E. M. Everitt, who used the building primarily as a grocery store.  Among the building's numerous other tenants were the Masonic Lodge and the Golden Jersey Creamery.  An Edinburg landmark, the structure stands as part of the city's early economic history. (1983)","atlas_number":"5215001514","latitude":26.302408861474795,"longitude":-98.1612088497083},
{"markernum":"3010","title":"Laguna Seca Ranch","indexname":"Laguna Seca Ranch","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"580424","utm_north":"2930087","code":"ranches/ranching","year":"1975","rthl":"0","loc_desc":"from Edinburg, take US 281 North about 6 miles to junction with 490, continue north on 490 2 more miles then go west on local road about 4 miles","size":"18\"\" x 28\"\"","markertext":"Macedonio Vela settled here in 1867 and soon transformed over 4,000 acres of wild brush land into prosperous Laguna Seca (Dry Lake) Ranch.  In 1871, his daughter, Carlota, grew the first orange trees in Hidalgo County from the seeds of a fruit given her by a traveling priest.  This is now an important-citrus-producing area.  The ranch had grown to 80,000 acres when a school was built here in 1892.  Delfina Post Office, named for another one of Vela's daughters, was opened in 1893 and a Catholic church in 1894.  Laguna Seca Ranch is still owned by the Vela family.  (1975)","atlas_number":"5215003010","latitude":26.488955245160177,"longitude":-98.19303033935572},
{"markernum":"3270","title":"McAllen First Methodist Church","indexname":"McAllen First Methodist Church","address":"","city":"McAllen","county":"Hidalgo","utm_zone":"14","utm_east":"576511","utm_north":"2898707","code":"Methodist (Methodist Episcopal and United Methodist) denomination; churches","year":"1989","rthl":"0","loc_desc":"221 North Main, McAllen","size":"18\"\" x 28\"\"","markertext":"The earliest record of Methodist church activity in the lower Rio Grande Valley dates to 1849.  Circuit-riding ministers served an area along the Rio Grande from Brownsville to Roma.  In 1909 the Rev. C.W . Godwyn was assigned to serve Methodists in McAllen, and a small frame sanctuary was built that year.  It was replaced by a larger structure in 1913.  Continued growth in the congregation led to construction of the present facility in 1928.  This congregation continues to be an important part of the McAllen community.  (1989)","atlas_number":"5215003270","latitude":26.205853923215464,"longitude":-98.23415808643293},
{"markernum":"3980","title":"Penitas","indexname":"Penitas","address":"","city":"Mission vicinity","county":"Hidalgo","utm_zone":"14","utm_east":"561860","utm_north":"2896192","code":"cities and towns; Spanish immigrants/immigration; settlements","year":"1970","rthl":"0","loc_desc":"from Mission, take FM 2062 south about 5.5 miles","size":"27\"\" x 42\"\"","markertext":"Possibly one of oldest towns in the United States.  Established, according to tradition, in mid-1520s.        Founders were a priest and five other Spaniards of the unsuccessful Panfilo de Narvaez Expedition into Mexico in 1520.  Narvaez was sent to arrest or kill Hernando Cortez, conqueror of Mexico, who was accused of disloyalty to the king.  Cortez, however, defeated Narvaez in battle, imprisoned him, and took most of Narvaez's army for his own.  After Narvaez was released from prison (1521), he and the remnant of his men set out for Florida.  But Father Zamora and five officers gave up further plans to travel with Narvaez, and settled at Penitas.        The refugees were befriended by Indians living in huts and dugout-type homes in the vicinity.  The Spaniards erected stone houses with whitewashed walls.  Father Zamora brought the Catholic faith to the Indians, also teaching them weaving and better farming.  The Indians taught cookery to their guests.        Cabeza de Vaca, aide in a later Narvaez expedition, is famous for having written of his shipwreck and wanderings in Texas from 1528 to 1535.  The founders of Penitas are recalled best by their descendants, some of whom still live in this area.  (1970)","atlas_number":"5215003980","latitude":26.18385187203377,"longitude":-98.38092065330093},
{"markernum":"4523","title":"San Antonio and Rio Grande Railway; \"\"Old Flossie\"\"","indexname":"San Antonio and Rio Grande Railway; \"\"Old Flossie\"\"","address":"","city":"San Juan","county":"Hidalgo","utm_zone":"14","utm_east":"584105","utm_north":"2898252","code":"railroads","year":"1991","rthl":"0","loc_desc":"US 83 access road (south, east-bound) about 0.5 miles west of FM 1426, San Juan","size":"18\"\" x 28\"\"","markertext":"Beginning operations in 1909, the San Antonio and Rio Grande Railway Company became a branch of the St. Louis, Brownsville and Mexico Railway in 1912.  Nicknamed \"\"Old Flossie,\"\" it provided freight and passenger transportation to the new towns of Chapin (Edinburg) and San Juan during a crucial time in the area's development.  Passenger service decreased after World War II, and the line was limited to freight service.  It was absorbed by the Missouri Pacific system in 1956.  By the late 1960s all service to San Juan and Edinburg ceased, the rails were removed, and the depots were razed.  (1991)","atlas_number":"5215004523","latitude":26.201321084233232,"longitude":-98.15818125195013},
{"markernum":"16291","title":"Asadores Ranch","indexname":"Asadores Ranch","address":"","city":"Run","county":"Hidalgo","utm_zone":"14","utm_east":"594099","utm_north":"2884305","code":"ranches/ranching","year":"2010","rthl":"0","loc_desc":"7 mi. S of Donna at US 281 and FM 493","size":"18\"\" x 28\"\"","markertext":"Salvador Cavazos Gallegos and his wife, Maria San Juana Anzaldua, founded Asadores Ranch in 1881 on the Mexican La Blanca land grant to Lino Cavazos. The Cavazos family raised cattle and horses and grew corn, beans and other crops along the Rio Grande.  Cavazos family members and ranch workers formed a small but important community. The land remained in the Cavazos family until 1902 when it was sold to John Closner. The family retained a one acre burial site where Salvador Cavazos Gallegos and Maria San Juana Anzaldua were buried in 1886 and 1887. The cemetery continued to be used by the family into the 1940s. Asadores Ranch is an example of the many eighteenth and nineteenth century Hidalgo County ranch settlements.","atlas_number":"5507016291","latitude":26.07478093109888,"longitude":-98.05916992339544},
{"markernum":"1809","title":"First Pharr School","indexname":"Pharr School, First","address":"","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581701","utm_north":"2897177","code":"educational topics","year":"1985","rthl":"0","loc_desc":"206 E. Cherokee, Pharr","size":"18\"\" x 28\"\"","markertext":"Erected in 1911 as a one-story structure, this building housed the first school in Pharr.  John Bales, the contractor, built a number of the town's early structures.  Classes were held here until 1915, when enrollment had grown from nine students to almost 80.  During that time, the building also served as a community church.  In 1915 Pharr and San Juan joined to construct a two-story school on the east edge of Pharr.  This structure was used for many years as a residence.  It was remodeled as a convalescent center in 1949. (1985)","atlas_number":"5215001809","latitude":26.191754041853887,"longitude":-98.18230902478035},
{"markernum":"2469","title":"Hidalgo County Bank and Trust Company","indexname":"Hidalgo County Bank and Trust Company","address":"","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608616","utm_north":"2892622","code":"banks, bankers, banking topics","year":"1982","rthl":"0","loc_desc":"301 S. Texas Avenue, Mercedes","size":"18\"\" x 28\"\"","markertext":"The oldest Hidalgo County bank still in operation, this institution opened in 1907 in a frame house on Third Street. Incorporators of the firm were area leaders J. M. Johnson, Sr., who served as the first president, his son J. M. Johnson, Jr., William M. Price and S. P. Silver, all of Mercedes; John Closner of Hidalgo; and Walter A. McNeil of Santa Maria.  Sound leadership helped the Hidalgo County Bank and Trust Company survive the economic depression of the 1930s and to become a leader in the development of the Rio Grande Valley area. (1982)","atlas_number":"5215002469","latitude":26.148848553881887,"longitude":-97.913349938287},
{"markernum":"4455","title":"Saint Joseph Catholic Church","indexname":"Saint Joseph Catholic Church","address":"","city":"Alamo","county":"Hidalgo","utm_zone":"14","utm_east":"588198","utm_north":"2895871","code":"eccesiastical buildings; churches; Gothic Revial (Architectural style);  Roman Catholic denomination","year":"1985","rthl":"0","loc_desc":"E. Bowie Ave at S. 7th Place","size":"18\"\" x 28\"\"","markertext":"Land at this site originally was deeded for church use by the Alamo Land and Sugar Company.  Construction of the Gothic revival church building was completed in 1924, the year Alamo was incorporated.  Development of St. Joseph Parish was guided by pastors from Sacred Heart Catholic Church in McAllen until 1927, when St. Joseph was designated an independent parish.  Church facilities have served over the years as social centers for the community and places of refuge for hurricane victims.  St. Joseph Catholic Church remains an important part of the religious heritage of Hidalgo County.  (1985)","atlas_number":"5215004455","latitude":26.179578539564545,"longitude":-98.11737966494528},
{"markernum":"4543","title":"San Juan Hotel","indexname":"San Juan Hotel","address":"125 West 5th Street (Business 83)","city":"San Juan","county":"Hidalgo","utm_zone":"14","utm_east":"584231","utm_north":"2896972","code":"buildings; Mission (Architectural style); inns, hotels, motels; design and construction","year":"1985","rthl":"1","loc_desc":"125 West 5th Street (Business 83), San Juan","size":"16\"\" x 12\"\"","markertext":"The San Juan Hotel was completed and opened for business in 1920.  Its construction reflected the plans of the town's early business leaders to establish San Juan as a Rio Grande Valley commercial center.  Originally constructed with little ornamentation, the mission revival details were added in 1928.  These included the red tiled parapet along the roofline and the curvilinear parapet over the entryway.  Recorded Texas Historic Landmark - 1985.","atlas_number":"5215004543","latitude":26.18975704634817,"longitude":-98.15700341862052},
{"markernum":"13233","title":"Pharr Volunteer Fire Department","indexname":"Pharr Volunteer Fire Department","address":"114 W Cherokee","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581416","utm_north":"2897274","code":"fire and fire departments","year":"2004","rthl":"0","loc_desc":"114 W Cherokee","size":"18\"\" x 28\"\"","markertext":"In July 1916, the same year voters incorporated the city of Pharr, a large fire laid waste to an entire downtown city block. As a result of the blaze, the community lost Pharr Lumber Co., Pharr Mercantile Co., Folsum Hardware Co., National Theatre and several other businesses.     During that same era, National Guard troops were stationed in the area to combat incursions from revolutionary forces in Mexico. When the troops left at the beginning of World War I, they left behind hose reels that the community adopted as its first fire equipment. Judge L.J. Polk, Sr. and D. \"\"Chief\"\" Simmons led local residents in loosely organizing a group of 10 to 12 volunteers, and they directed citizen efforts in fighting fires. During the winter of 1921, the Pharr Volunteer Fire Department officially formed with J.E. Rogers as chief.     During the next 10 years, the number of volunteers grew and the department organized into three companies: engine, chemical and hose. In 1928, the city comissioned assistant fire chief O.C. Brown to build the first fire station; a room in the rear of the building briefly served as city jail. Two years later, the fire department received a state charter.     In the 1980s, as population grew in the Pharr, San Juan and Alamo area, a control room in the station enabled volunteers to respond to tri-city fire alarms. Citizens worked to preserve the original fire station when it faced demolition in 2001, and the city later built new facilities for the fire department.  (2006)","atlas_number":"5215013233","latitude":26.1926460075249,"longitude":-98.18515507531338},
{"markernum":"13007","title":"The Donna News","indexname":"Donna News, The","address":"127 S 8th St","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594348","utm_north":"2894835","code":"newspapers","year":"2003","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"In 1904, T.J. Hooks and A.F. Hester, Sr. founded towns on the StLB&M Rail Line. Railroad president Uriah Lott chose the names of Hooks' daughters for two towns, Donna and Beatrice (East Donna). In 1910, Garland Buck built a two-story brick building at this site for the Donna Developer. It changed hands several times, known also as the Donna Dispatch, the Donna News and the Donna News-Advocate until its run ended in the 1960s. In 1969, the Donna Chamber of Commerce bought the building and later shared it with the Donna Hooks Fletcher Museum, created in 1974. A fire damaged the structure in 1988, but its restoration and use as part of the museum helps preserve the history of the paper and the community it served. (2005)","atlas_number":"5215013007","latitude":26.169834553100078,"longitude":-98.05591682866911},
{"markernum":"13785","title":"Run","indexname":"Run","address":"FM 493","city":"Donna","county":"Hidalgo","utm_zone":"14","utm_east":"594099","utm_north":"2884305","code":"cities and towns; settlements","year":"2004","rthl":"0","loc_desc":"7 mi. S of Donna at US 281 and FM 493","size":"18\"\" x 28\"\"","markertext":"This area in the mid-1800s was part of the Asadores Ranch owned by Salvador and San Juana Cavazos. In 1898, east Texas rice farmers A.F. Hester, Sr. and T.J. Hooks bought land in the vicinity. They and others began La Blanca Agricultural Company and the Arroyo Canal Company to build an irrigation system. They also helped usher the railroad into the area. Ed and George Ruthven moved to the area by 1904. Ed established a store and was postmaster for the community of Run (a contraction of his surname), and George built irrigation pumps. Andrew Champion also owned a general store. A school opened in 1905, but many area residents began moving to Donna following a devastating flood four years later. (2006)","atlas_number":"5507013785","latitude":26.07478093109888,"longitude":-98.05916992339544},
{"markernum":"871","title":"Citrus Fruit Developed in Rio Grande Valley - Red-Meat Grapefruit","indexname":"Citrus Fruit Developed in Rio Grande Valley - Red-Meat Grapefruit","address":"","city":"Weslaco","county":"Hidalgo","utm_zone":"14","utm_east":"603659","utm_north":"2893036","code":"agriculture, general; botany","year":"1966","rthl":"0","loc_desc":"Texas A&M Experiment Station: From Weslaco, take US 83 east about 1.5 mi.  Enter Station and go right into parking lot.  Marker is in doorway of 2nd bldg. on left. (1/4 mi west of FM 1015)","size":"18\"\" x 28\"\"","markertext":"Unique and colorful product of saline-alkaline soil of Rio Grande Valley of Texas.  Bred of Thompson Pink Wood budded on Sour Orange rootstock.      Two nurserymen, A. E. Henninger of Mission and Dr. J. R. Webb of Donna, discovered red fruit in their orchards in 1929.  They cast lots and Henninger won right to get a patent.  He named his variety \"\"Ruby Red,\"\" and was issued U.S. Plant Patent No. 53. Dr. Webb's new strain, \"\"Red Blush,\"\" is equally popular.  Both varieties, with rose-colored meat and red-tinged rinds, are sweet, early, delectable fruits.","atlas_number":"5215000871","latitude":26.152951784458157,"longitude":-97.96290261487461},
{"markernum":"2471","title":"Hidalgo Irrigation Pump Plant","indexname":"Hidalgo Irrigation Pump Plant","address":"","city":"Hidalgo","county":"Hidalgo","utm_zone":"14","utm_east":"573848","utm_north":"2886693","code":"agriculture, general; factories, industrial buildings; water topics","year":"1989","rthl":"0","loc_desc":"at levee, S. end of 2nd Street, SE end of building, Hidalgo","size":"18\"\" x 28\"\"","markertext":"The semi-arid Lower Rio Grande Valley was productive only for cattle grazing until several steam-powered irrigation systems were established in the early 20th century.  In 1909, a steam pump was built here to channel Rio Grande water to about 40,000 acres of land.  The Louisiana-Rio Grande Canal Company installed additional equipment in 1911-12 to increase production to the Pharr-San Juan-Alamo area.  Sold to the Hidalgo County Water Improvement District in 1920, the pump plant continued in operation until 1983, when an all-electric plant opened downstream. (1989)","atlas_number":"5215002471","latitude":26.0975199745243,"longitude":-98.26149491587665},
{"markernum":"2961","title":"Kiwanis Club of Pharr","indexname":"Kiwanis Club of Pharr","address":"302 W. Park","city":"Pharr","county":"Hidalgo","utm_zone":"14","utm_east":"581250","utm_north":"2897514","code":"fraternal organizations; buildings; Mission (Architectural style); institutional buildings","year":"1981","rthl":"1","loc_desc":"302 W. Park,Pharr","size":"16\"\" x 12\"\"","markertext":"This Mission style building was the first meeting place in the Kiwanis International organization owned by a local club.  It was built in 1928, 13 years after the formation of the first Kiwanis club in Detroit, Michigan, and one year after the Pharr club was chartered.  Designed to serve as a community center, it has been used for a variety of civic functions and meetings and has housed offices of the city Chamber of Commerce.  Recorded Texas Historic Landmark - 1981","atlas_number":"5215002961","latitude":26.194822296010706,"longitude":-98.18680128968195},
{"markernum":"3127","title":"Los Ebanos Ferry Crossing","indexname":"Los Ebanos Ferry Crossing","address":"FM 886","city":"Los Ebanos","county":"Hidalgo","utm_zone":"14","utm_east":"543620","utm_north":"2902344","code":"Exploration and expeditions; boats, ships, ferries, barges, and other marine vessels; water topics","year":"1974","rthl":"0","loc_desc":"at ferry crossing, FM 886 on south side of Los Ebanos","size":"18\"\" x 28\"\"","markertext":"Apparently this is an ancient ford.  First recorded usage was by Spanish explorers and colonists under Jose de Escandon in 1740s on the Rio Grande.  A salt trail led from here to El Sal del Rey (40 miles northeast).  The ford was used by Mexican war troops, 1846; by Texas Rangers chasing cattle rustlers, 1874; by smugglers in many eras, especially during the American prohibition years, 1920s and '30s.  The ferry and inspection station were established in 1950.  Named for the ebony trees here, this is known as the only government-licensed, hand-pulled ferry on any boundary of the United States.    (1974)","atlas_number":"5215003127","latitude":26.24006980073358,"longitude":-98.56324957534726},
{"markernum":"3457","title":"Moore Field","indexname":"Moore Field","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566952","utm_north":"2917576","code":"World War II; aviation; military topics","year":"1981","rthl":"0","loc_desc":"from Mission, take FM 2993 north about 8 miles to FM 1925, then take FM 1925 west about 2 miles, then go north on FM 681 about 1 mile","size":"18\"\" x 28\"\"","markertext":"A United States aviation training field, originally financed by the nearby cities of Edinburg, McAllen and Mission, was started here in 1941.  Named for Lt. Frank M. Moore, a pilot killed in World War I, it was used for the training of World War II airmen.  After the field was closed in 1945, the facilities were shared by a tri-cities commercial airport and the Weaver H. Baker Memorial Tuberculosis Hospital.  Reactivated as Moore Air Force Base during the Korean War of the 1950s, the site has housed research offices of the United States Department of Agriculture since 1960.  (1981)","atlas_number":"5215003457","latitude":26.37669739355674,"longitude":-98.32885397717595},
{"markernum":"4132","title":"Progreso","indexname":"Progreso","address":"","city":"Progreso","county":"Hidalgo","utm_zone":"14","utm_east":"604216","utm_north":"2886274","code":"cities and towns; agriculture, general; Spanish immigrants/immigration; land surveys, land companies, promotional towns","year":"1993","rthl":"0","loc_desc":"on Progreso City hall, FM 1015, 3 miles North of US 281, Progreso","size":"18\"\" x 28\"\"","markertext":"Land in this area was part of a Spanish land grant requested by Juan Jose Hinojosa in 1776 and awarded posthumously in 1790.  Hinojosa had occupied the land and used it for livestock pasture since 1766.  In 1896 ranchers in the area obtained a U.S. post office under the name Progreso.  Soon thereafter commercial farming interests began large scale operations in growing sugar cane and, later, citrus groves.  The Progreso Development Company platted the townsite in 1927.  The town continued a steady period of growth, and citizens voted for incorporation in 1991.  (1994)","atlas_number":"5215004132","latitude":26.091862816982804,"longitude":-97.95787239472372},
{"markernum":"5255","title":"Texas Citrus Fiesta","indexname":"Texas Citrus Fiesta","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"567952","utm_north":"2900392","code":"agriculture, general; fairs and festivals","year":"1989","rthl":"0","loc_desc":"1420 E. Kiko De Lia Garza Loop, at Entry to Lions Park, Mission","size":"27\"\" x 42\"\"","markertext":"In the 1920s John H. Shary, citrus grower and local developer, began plans to promote locally grown citrus crops on a large scale.  The first Texas Citrus Fiesta, with the theme \"\"Coronation and Pageant of Citrus\"\" was held in 1932 with the same promotional purpose. Among the events in the one-day celebration were a coronation ceremony for Fiesta royalty, citrus exhibits, fruit packing contests, a flying circus, a football game, and a parade.      Two years later the Fiesta was a four-day event held in Lions Park, and the fiesta style show was introduced.  Over the years the Fiesta has grown into a two-week event, with added events such as an outdoor festival, barbeques, and a carnival.  The product costume style show, for which costumes are made from local agricultural products, has become one of the most popular annual events.        The Texas Citrus Fiesta has evolved into a notable cultural event in the Rio Grande Valley.  Many prominent citizens have served as Fiesta royalty over the years. The purpose of the annual event has remained that of John H. Shary's vision-to promote the area's citrus industry on a large scale.  (1989)","atlas_number":"5215005255","latitude":26.221498367146964,"longitude":-98.31973637753461},
{"markernum":"5675","title":"W. L. Lipscomb","indexname":"Lipscomb, W. L.","address":"","city":"Edinburg","county":"Hidalgo","utm_zone":"14","utm_east":"583598","utm_north":"2909229","code":"county official; Business topics, general; markets, merchantiles","year":"1983","rthl":"0","loc_desc":"114 East Cano Street, Edinburg","size":"18\"\" x 28\"\"","markertext":"About 1880, South Carolina native William Lawton Lipscomb (1874-1941) came to Texas with his family.  In 1894 he settled in Hidalgo County, where he managed a sugar plantation.  Later he and his wife, Ada (Dougherty) (1877-1959), moved to Edinburg and established one of the city's first general mercantile stores.  Lipscomb moved his business to this building after it was completed in 1910.  As an Hidalgo County Commissioner from 1909 until 1925, a prominent businessman, and an active Mason, Lipscomb provided significant service and leadership to the community.  (1983)","atlas_number":"5215005675","latitude":26.300457399282948,"longitude":-98.16254516599119},
{"markernum":"12628","title":"1940 Train-Truck Collision","indexname":"1940 Train-Truck Collision","address":"100 N. Tower Rd.","city":"Alamo","county":"Hidalgo","utm_zone":"14","utm_east":"588823","utm_north":"2895930","code":"automobile topics; railroads","year":"2002","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"On March 14, 1940, at this crossing of Tower Road and the Missouri Pacific rail line occurred an automobile accident resulting in the most fatalities on a Texas highway in the 20th century.  An oncoming train collided with a truck carrying more than 40 agricultural workers, killing 34 of the workers, who ranged in age from ten to 48.  The neighboring citrus packing plant served as headquarters for rescue operations.  The tragedy affected many lives in the Alamo community and across the Rio Grande Valley, resulting in renewed attention to safety issues surrounding railroad crossings and the transportation of agricultural workers. \t(2002)","atlas_number":"5215012628","latitude":26.180072734224993,"longitude":-98.11112168568938},
{"markernum":"7658","title":"Laurel Hill Cemetery","indexname":"Laurel Hill Cemetery","address":"","city":"Mission","county":"Hidalgo","utm_zone":"14","utm_east":"566484","utm_north":"2900927","code":"graveyards","year":"2008","rthl":"0","loc_desc":"Holland and Rankin streets","size":"18\"\" x 28\"\"","markertext":"This burial ground has served the Mission community since 1913, when graves were moved here from the first city cemetery because of unsuitable land conditions. Those buried here include John J. Conway (d. 1931), city of Mission founder; Dr. Cleo Dawson (d. 1991), author and television personality; and Floyd H. \"\"Slats\"\" Rodgers (d. 1956), noted aviator and stuntman. Also interred are community leaders, area pioneers and veterans of military conflicts dating to the Civil War. The cemetery, which is cared for by the City of Mission, features false crypts, fraternal markers, vertical stones, mausoleums, religious statuary and curbing.     Historic Texas Cemetery - 2007","atlas_number":"5507007658","latitude":26.226397649695933,"longitude":-98.33440414782942},
{"markernum":"15788","title":"Immanuel Lutheran Church","indexname":"Immanuel Lutheran Church","address":"703 West Third Street","city":"Mercedes","county":"Hidalgo","utm_zone":"14","utm_east":"608232","utm_north":"2892632","code":"churches; Lutheran denomination","year":"2009","rthl":"0","loc_desc":"","size":"18\"\" x 28\"\"","markertext":"The Rev. E. J. Moebus was sent by officials of the Texas district of the Lutheran Church - Missouri Synod to establish Lutheran congregations in the Rio Grande Valley. Evangelical Lutheran Emanuel Church organized at Mercedes on October 30, 1910. The American Rio Grande Land and Irrigation Co. gave property located along the railroad tracks to the group, and the church's first building was dedicated on May 28, 1911. The congregation later sold the property and purchased land on Washington and West Third streets. Although the original church building was moved to the new location in 1920, another structure was built and dedicated on the site in 1929. In 1945, the church was renamed Immanuel Evangelical Lutheran Church. (2009)","atlas_number":"5507015788","latitude":26.148967762829837,"longitude":-97.9171902884438}
]